[
    {
        "movie_name": "Inside Out 2",
        "movie_imdb_id": "/title/tt22022452/?ref_=sr_t_1",
        "YearDuration": [
            "2024",
            "PG",
            "1h 36m"
        ],
        "Ratings": [
            "8.0",
            "/",
            "10"
        ],
        "ReviewRelatedInfo": [
            {
                "User reviews": "277"
            },
            {
                "Critic reviews": "177"
            },
            {
                "Metascore": "73"
            }
        ],
        "FilmPlot": "The cast and filmmakers of Inside out 2 talk meeting on a dance floor, trying to capture a feeling in the recording studio, and more.",
        "UserReviews": [
            {
                "Rating": "9",
                "Title": "\"Maybe this is what happens when you grow up, you feel less joy\"",
                "Content": "Inside Out 2 talks about \"growing up\" in an emotional way and depicts how growing up is challenging inside our thoughts. The film introduces the emotions we had from the previous movie: Joy, Anger, Sadness, Fear and Disgust. We are also introduced to new emotions: embarrassment, Ennui (boredom), Envy and Anxiety.Riley is about to go to high school but the story focuses on her preparation to officially join the FogHorn Hockey team. As the story progresses, Riley finds herself challenged with her hopes to join the team. Her friendship was wounded, her emotions went all over the place and the pressure got into her head. But eventually, everything goes into their proper places.This sequel film may be animated and made for kids but as an adult, it just hits differently. I can say that this film was partially made for adults and for anyone who is in a bad mental situation. It reminds its viewers how growing older can be tough, how overthinking affects everything else, how decisions that are made today may affect what's next. But it is also a strong reminder that problems, fear, worries and anxieties will come. They are all inevitable but everything will pass. Take a deep breath, stay calm and do not overstress everything. Having a calm mind also affects the way we think. We may feel pressure at any given time but we have to sit back and relax.Do not overstress things at the present. Live at the moment. The future is there but we live at the present, right here, right now. Enjoy life. Remember that you are not alone on whatever you are facing. Keep your friends and family close. And finally, God is always with us.Inside Out 2 is a great film. Every audience will have a different way of enjoying this but just remember, you are who you are. Embrace yourself.#InsideOut2 #moviereview.\n\n                    173 out of 195 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "9",
                "Title": "This movie resonates not just with children, but the more mature audience as well. That's what makes animated movies great",
                "Content": "I can't believe I'm saying this, but this is one of the best Pixar movies to date. I did not expect to like this movie very much. Disney and Pixar have been vastly disappointing and even controversial recently, but Inside Out 2 rivals Pixar's best movies like Up, Monsters inc., Ratatouille, The Incredibles and Toy Story in quality.I found the story very moving. The best animated movies ever made appeal not just to children, but resonate with the more mature audience as well. And that's what this movie does.The theme was very poignant. I loved the introduction of the new characters and especially how they incorporated anxiety into the transformation of puberty. Anxiety is not fun, but many people struggle with it.The ending was great too. I love that they didn't wrap it up in a cliche way.Great job Disney and Pixar!\n\n                    53 out of 63 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "10",
                "Title": "Best Pixar sequel since Toy Story 3",
                "Content": "Just finally saw Inside Out 2.It is ABSOLUTELY FANTASTIC and INSTANT CLASSIC Pixar masterpiece ever. A triumphant full circle moment for Pixar. An emotional rollercoaster from beginning til the end. Animation is pure perfection. Pacing is brilliant. Musical score is magnificent. Visuals are stunning & dazzling. Story was very beautifully heartfelt. The voice cast performance was incredibly stellar with old and new familiar faces especially Maya Hawke as Anxiety and Ayo Edebiri as Envy being massive standouts. You'll laugh, cry, and fall in love with this movie. It will blow your mind. Really like it's one of the BEST Pixar sequels in ages since Toy Story 3. A special, once in a lifetime cinematic experience full of heart. A MUST-WATCH for everyone!This will be a massive box office juggernaut & deservedly so.Totally the best animated movie of the year you'll ever see. Period.Kudos to Kelsey Mann & the cast & crew of Inside Out 2!\n\n                    110 out of 140 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "8",
                "Title": "Good job Pixar",
                "Content": "A sequel with beautiful execution and sufficient maturity to make this film a sequel that is no less than the first film. Even though the conflict shown is not as complex as the first film, but it still made my tears almost slide through my eyes. Such as the scene of Bing Bong saying the dialogue \"Take her to the moon for me\" in the first film, I did not find any emotions that were successfully expressed by the dialogue or scenes. But okay, that's okay, I still like it. The point is that you will find a feeling of nostalgia, a strong emotional feeling (although not too much), this film will be liked by every millennial child and children who want to go back to watch the second film to reminisce, I mean children who have grown up. The overall rating for this film is 8/10, it is definitely worth watching.\n\n                    49 out of 67 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "10",
                "Title": "Overall, I think this movie is perfect for everyone, though I think this movie is best for pre-teens, teens, & adults.",
                "Content": "Watched Inside Out 2 today!For the parents out there: Please do explain the concept of the movie BEFORE going into it with your kid. Though I get emotions are difficult & complex to understand, even for adults (as shown perfectly by Inside Out 1&2), I guess no harm will come from saying something to them before watching the movie. My seatmates came with their kid (est. Age 5-8) and the parent had such a difficult time explaining the complexities of different emotions DURING THE MOVIE. Kids are confused and WILL ask questions, guide them to see what the message of this movie is trying to say. It will help them to understand their emotions as they grow up. Make the experience more meaningful. Anyways, just keep in mind of cinema etiquette I guess...But with that, I LOVED this movie. I have never been so validated and seen in my life. In the media today, we all see how anxiety is portrayed but never how it really is. This movie just explained why I am the way I am, and maybe even how to live life even when things get overwhelming and complicated. If anything, ALL of our emotions are important. There's this one line by Joy that is so perfectly said. It struck out to me so much since my dad died when I was 19. Just before \"adulthood\", just before anything really. So I shut everything out. My last year of being a teenager came to waste because of the daily breakdowns. I forgot how to live. I forgot how to be happy. I became so numb to the point that everything became black & white. I was on auto-pilot and I didn't even notice it until everything came crashing down.This movie has highlighted what I have been going through for the past year and showing how wrong it was to shut the grief out. Emotions are meant to be felt. Life is overwhelming BUT Life is meant to be lived.There's this one cartoon-ish character that really brought me flashbacks as a 2000s kid. HAHAH kudos to the person who thought of that. Then again, I wish they(😉) had more depth to them (in a way).Overall, I think this movie is perfect for everyone, though I think this movie is best for pre-teens, teens, & adults.\n\n                    46 out of 63 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "7",
                "Title": "First film better",
                "Content": "All in all, while \"Inside Out 2\" has a good concept and loveable characters, it is not perfect. Promoted as an entertaining event that lasts one and a half hours, it has a problem with a story. It introduces Joy, Sadness, Anger, Disgust, and Fear again who travel through teenage Riley's mind, but it is not as profound as the first movie. While pacing appears to be slow with large chunks where not much story occurs and the audience is not able to form a bond with the character. Although the first film was emotional and deeply meaningful, \"Inside Out 2\" lacks a single, overarching message compared to its predecessor. The humor and warmth are insufficient to make up for the shoddy plot, even though some of the animation and voice acting are excellent. Younger audiences will find it entertaining, but it falls short of the first film's potential, which will disappoint some viewers who were hoping for yet another heartwarming tale.\n\n                    23 out of 31 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "8",
                "Title": "Inside Out 2 - A good movie",
                "Content": "I have disliked a number of Pixar movies, for being idealess and soulless. It truely felt like Pixar had lost all of their magic. But Inside Out 2 is a welcome movie among recent disappointments. Not at all perfect but still good! The story of Riley's transition into her teenage years, and finding a way to handle all of her new emotions, especially anxiety, appeal not just to children, but resonate with the more mature audience as well. The theme can be a little complex for younger audience. However the writers mange to keep it simple, funny and emotional. All the classic signs of a truly good Pixar movie. I loved the introduction of the new characters, and found them all to be likable in there on way. You could understand the motivation of each character, and none of them were over the top and outstayed their welcome \"Except nostalgia\" :-) The ending was great too. I love that they didn't wrap it up in a cliche way. Over all Good! Therefore i give it 8 starts. Great job Disney and Pixar!Content collapsed.\n\n                    9 out of 10 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "6",
                "Title": "Missing the spark",
                "Content": "I am quite surprised at the overall positive reactions for this film compared to the first one as I don't think they are comparable at all.Unlike the first film, Inside Out 2 felt rushed and lacked the time to properly develop each character. The film lacked direction at times and felt quite disconnected. The first film had an amazing sense of journey and adventure and I think that's where this one missed the mark. The journey undertaken by the original characters simply didn't have the same sense of purpose the storyline felt forced to try and rush to the end where where we all learn lesson of the complexity of emotions are what life is about.All in all not a bad film, the animation was still great, same with the voice acting, it just lacked the extra magic of the first and didn't quite evoke the same feelings.6/10.\n\n                    90 out of 134 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "9",
                "Title": "Emotions Personified",
                "Content": "This recaptures the magic of the first film. The personification of various emotions cleverly shows the nature of human feelings and actions.The writing is great, with a strong message about emotional growth and understanding oneself. The animation is full of bright colors and unique designs, making every scene visually appealing. The voice actors' performances were fantastic, adding depth and authenticity to the characters. The story flows smoothly, and the pacing keeps you engaged from start to finish.I recommend watching it in IMAX-it enhances the immersive experience. The larger screen and better sound quality make the vibrant animation and emotional scenes even more impactful.\n\n                    27 out of 39 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "5",
                "Title": "I dont think im the target audience.....",
                "Content": "Very disappointing, wasnt funny, wasnt entertaining or interesting. Animation of course is amazing but it just lacked any real sustance, its a rehash of the first film with a few added emotions, anxiety being the main one. Best character was the 00s inspired ps2 looking game character that really wasnt in it much. Its not a patch on the first , not sure how its running at 8.0 out of 10 on here....??Takes ages to get going, the first hockey scene is just drab, uninteresting. I do realise for a guy in his 50s this isnt who pixar is aiming at. Not one person in a full cinema laughed out loud , or at all from what i could tell.\n\n                    33 out of 59 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "10",
                "Title": "Anxiety in its full glory",
                "Content": "I've been battling this emotion for so long, that I've finally begun to understand it. It took therapy, of course, and a lot of looking inwards. Having watched this film as a 40-year-old woman I can say, this right there - that's what anxiety does to you.This film does it so well - showing yet again how toxic forced positivity can be and how we need all of our emotions and memories in order to fully understand ourselves and grow. Everything we want to repress, everything we throw away to the back of our head will come to bite us in the behind. All of these shameful or cringeworthy memories need to be accepted to our consciousness and then gracefully let go. Otherwise the anxiety will consume us.\n\n                    25 out of 36 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "8",
                "Title": "Inside Out2 - as best as the first movie",
                "Content": "In a time when animated features have often fallen short of expectations, \"Inside Out 2\" emerges as a beacon of hope, reminding us of Pixar's long-forgotten quality. This sequel not only matches the brilliance of the first film but even better in many ways. The emotional depth, innovative storytelling, and a Pixar production quality make it a must-watch.Overall, \"Inside Out 2\" is a triumph in animation, proving that Pixar still holds the crown in creating compelling and memorable films. It's a cinematic experience that leaves a lasting impression, and one that you won't regret watching on the big screen.\n\n                    31 out of 49 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "10",
                "Title": "A Worthy Sequel",
                "Content": "Rare to see nowadays but a worthy sequel. As great as, or maybe even better than the first movie.The whole plot is really cute and enjoyable. Riley is likeable as always. The old emotions and new emotions and the relationship between those, the whole anxiety debacle (health at a certain amount, problem when it is excess) is not only entertaining but also teaching. And teaches not only to the children, but as an adult, you can also learn a lot from this movie.I really hope to see a third one in the future. And I really think Disney theme parks should invest in this franchise. 2 great movies with 2 box office hits.\n\n                    21 out of 34 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "8",
                "Title": "Inside Out 2 is a Well Written film",
                "Content": "It can connect to you in some way, as Riley is trying to act cool around the cool kids. And as a teenager, she's moved on from her past life, the gigs, her old friends. She is always trying to move on, act cooler and make new friends. As a Teenager, I can say this side to the story is very relatable. And it's what works about this story. Some teenager can relate, and that's why it's great, and Riley is a well written character throughout the first and second film.Riley also plays sports, and I enjoy the sport she likes. She plays Hockey, and tries her best to get into the team. Which all people try and do, another relatable side to the story. And I love how relatable it was throughout. After the disappointment of not being ready, she tries harder, and as a result of that it hurts the people she loves the most, as she's overly fixated on becoming a champ at Hockey. And she tries her best to prepare herself.The added characters felt a bit gimmicky at times, but I more or less enjoyed the new Characters. Especially Embarrasment, I always laughed when he was on. And he was a great character, as well as Anxiety. Who was the main side character in the story, who tries to set up Rileys future and fails.I love how are old characters are split up from the new, it creates some tension and drama. Whilst building up some character development for are new Characters. Which works well for both old and new. And the set up with Riley as a teenager is brilliant throughout too, she has some great moments in Hockey and with anger and dismissive attitude towards her mother. And that is also very accurate amongst teenager behaviour.I had a double date and we all gave our verdict, so I'll share them with you, Me:8/10, My Girlfriend 10/10, Her best Friend 9/10, Her Boyfriend 9/10, so overall I would recommend this film, especially if your a teenager.\n\n                    11 out of 16 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "10",
                "Title": "This is for adults",
                "Content": "Now I just created this account this account to encourage anyone that's skeptical about seeing this movie to get up and go just go. I strongly believe this movie wasn't aimed for the audience of little kids it's aimed towards our generation us the new adults this movie hit and had me thinking about it hours after leaving the theaters it was fun emotional and had me engaged the whole time. Now I get people are saying this isn't magical like the first film and truth be told it's not. We had child like mindsets back then and carried it over hoping we'd feel what we felt the first time watching the first movie. And that's right it's not as magical but that's doesn't mean it's not better i thoroughly enjoyed the second one much more than first it's far more complex it's more relatable and this film now holds a special place in my heart. Younger kids will appreciate this movie more as they grow older they will and i may be overrating this movie but that's just how much it spoke to me. The humor was there. The emotions were there and most importantly the message was there. If they make a third one and I pray to god they do this will be the greatest pixar trilogy ever. Thank you pixar for not forgetting about the kids that grew up and delivering a movie that spoke to us. 10/10.\n\n                    10 out of 15 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "8",
                "Title": "A very nice ride of the mind a very mixed up girl.",
                "Content": "Giving this a 8.5/10Best Pixar film in a good while, just as good as the original. As the poster shows, new emotions and new adventures for Riley and the emotions inside her head. But really, everyone has these problems, no matter the age, so that makes it work, and the jokes are jolly good, some crazy humor runs through the film, despite the craziness of life nowadays.The action really does not stop much in this one, as the screen gets filled up by the colours of inside and outside life, perils and wonders, more peril than anything as the mind, sanity of poor old Riley gets well twisted up, again. It flies by at a good pace and feels other refreshing, which is hard, for most films at all, let alone a sequel. IMAX of this will be good if you can do it, quite sure the lungs of the actors were well and truly used up on this. Another five years for the next one, which must a theme of love, for sure.\n\n                    15 out of 27 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "6",
                "Title": "Inside Out 2",
                "Content": "I really quite enjoyed the first of these (2015) but I struggled a bit to stay engaged with the one. \"Riley\" is still happily coasting through family life until one day, she embarks on the yellow brick road that is puberty. Towit, her control gallery is no longer the purview of just her lifelong guides like \"Fear\", \"Joy\" and \"Anger\" - now she has also to deal with the likes of disgust, envy, boredom and worst of all - anxiety. It's maybe the latter that the film should be called as we now embark on quite a humourless swipe at the culture of validation that young people must navigate. It's all about being popular. Being liked. Being the best - in the ice hockey team. Old loyalties go under the bus in favour of new aspirations and yes, much of it does ring quite true as an evaluation of the fickleness in all of us. Thing is, though, there's just too much inevitability about what comes next and there's way too much incessant dialogue. \"Anger\" has some fun along the way, and there is the odd comedy one-liner from the laconic \"Ennui\" but it just didn't resonate with me at all. The animation is standard Pixar fayre that does the job colourfully but unremarkably, and by the conclusion I was hoping there was an off button on that great big console. Yep - I'm probably too old to really appreciate this the way the kids can, but the trick for these studios has to be to engage the adults at the same time as the weans, else out come the mobile phones as our own version of ennui sets in. It's fine, but forgettable, sorry.\n\n                    6 out of 7 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "4",
                "Title": "I feel less joy and not because of my age",
                "Content": "Comments like \"this may be good for you if you are a teenager\" are exactly what should be feared by the studios, with this movie you are narrowing the audience which was perfect in the first delivery, the over-explanation of character's actions and jokes denote a very poor dialog writing, there are no more memorable quotes, the characters have zero creative development, turning into more of the same in a bad way.I know almost nothing about writing credits but it makes obvious the change with the first movie, if this is the result of the absence of Pete Docter, believe me, it is remarkable.There are antagonists like in the first movie but now their development turns out to be far too obvious for example the false enemy which turns to be neccesary, the silly-but-required old memories and the caged-but-misunderstood villians, I mean, this is not a spoiler because is a copy-paste from the first delivery, the inclusion, which is now mandatory, sums nothing to the narrative.The pace is slow and predictive so I almost fell asleep, my wife almost fell asleep, my two friends almost fell asleep, and at least in the case of my local screenplay I felt constantly the sense of \"why are people laughing at that joke?\"Silly with no sense, only backed by the beautiful artwork, this movie will get forgotten in a couple of weeks, it is nothing compared with its predecessor.Took the time to write this because I am 100% sure that I wont see it again and maybe could save you some money, wait for the streaming.\n\n                    22 out of 41 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "9",
                "Title": "IS THIS A DOCUMENTARY FILM?",
                "Content": "\"I don't know how to stop anxiety. Maybe that's what happens when you grow up, you feel less joy.\" - Joy.I'm sorry. Is this a documentary about my life?I honestly never understood why so many people were like \"oh pixar is going down in ruins\" because soul luca and turning red were all great imo, but this tatstes way better after lightyear. This is a pixar hit.Best animated movie of the year! That's all I can say about this masterpiece.Synopsis:\nThe little voices inside Riley's head know her inside and out--but next summer, everything changes when Disney and Pixar's Inside Out 2 introduces a new Emotion: Anxiety.\n\n                    13 out of 24 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "10",
                "Title": "Bring 2 things: YOUR emotions and tissues",
                "Content": "In all my time on IMDb, I've only given 44 tens, and I've rated 500 movies... well now this makes 45. I know I'm not a certified critic, but for me there is something about Disney, ESPECIALLY Pixar. This movie evoked all of my emotions (Pixar tends to do that), but in such a clever and relatable way. Ever since the first Inside Out, I fell in love with this movie franchise and was so happy when they announced the second one... this one did not disappoint. It was in all honesty just slightly better than the first one, and I'm trying to wrap my head around how. This one is slightly better to me because of anxiety, envy, embarrassment, and ennui being added to the team and being of importance to the storyline. I don't want to give any spoilers, but all I will say is - anxiety and joy have to find a way to work together and being someone with severe anxiety this REALLY hit home.\n\n                    12 out of 22 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "9",
                "Title": "Pixar's back",
                "Content": "I seldom write reviews but just wanted to say Disney/Pixar are back to doing what they used to do best. My wife and I have noticed a dip in the quality of Disney kids films of late (or maybe it's our Nostalgia Emotion poking its head in to the 'good old days' when our kids were little)? But Inside Out 2 shows with the right writing you can have an excellent film. Thoroughly enjoyed it and it hit me and all my family on an emotional level. In between the release of Part 1 & 2 our kids have all just come through what Riley's experiencing in this film so it probably hits home a little more. Not withstanding Pixar nail the parents' emotions / thoughts extremely well. This film is great for all ages.\n\n                    2 out of 2 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "8",
                "Title": "A safer bet than the first movie. But not as daring.",
                "Content": "Inside Out 2 is a 'comfort food' sequel where the stuff of the first one is expanded upon and given more breathing room and making for nice world-building, but of course it goes without saying the film isn't as 'surprising' as its predecessor. However it's still very good.Inside Out 2 was probably an unusually safe bet for PIXAR: it was a sequel to their literally most 'cerebral' film and it looks like this one is gonna outperform the original film at the box office. So it's safe to say this series has become a 'lo-fi high-concept' franchise all about human thinking and emotions.I suppose the one big blemish of this film is that PIXAR has to potentially focus mostly on sequels now (as per Disney's relentless franchising): so what comes next? Bugs Life 2? Toy Story: The Infinity Saga Edition? Cars: Revved Up? Rata2ouille? Up Again? No thanks. Hopefully their next original outing, Elio, will be a success. But who knows?Inside Out 2 has just the right amount of depth to please kiddies and adults, and there's enough jokes to please both crowds also, and the story is still as honest as the first movie's. This meal has enough healthy and 'junk food' stuff to keep most of the audience happy and immersed.Inside Out 2 gets 8/10 IMDbs. 4/5 stars. It's a deserving sequel for a deserving movie. Here's hoping PIXAR's next outing has similar success.\n\n                    2 out of 2 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "6",
                "Title": "Not bad, but not that great either.",
                "Content": "What we have here feels like a cheap copy of the first film. Except where the first Inside Out was filled with 'magic' and 'wonder', this one is replaced with lacklustre moments and uninspired inserts. The train of thought becomes the stream of consciousness. The core memories are now core beliefs. And where in the first film, Riley must grapple with her entire known world collapsing beneath her - she now must grapple with going to a new high school without her middle school friends.The movie isn't exactly bad, but it feels cheaper in comparison. Even the lessons learned are important in this movie. Don't let anxiety control your brain.But isn't that what we learned from the first film? We saw Joy trying to be a control freak - and - what do you know - in this film, Anxiety turns into a control freak, causing a bunch of chaos for Riley.What's more, the new emotions seemed like lesser versions of the original emotions. Fear becomes Anxiety. Disgust becomes Envy. Sadness becomes Embarrassment and Ennui.It's just too bad that the first movie came out of seemingly nowhere and told a unique and loveable story with lessons for all ages, and in its sequel, we have a movie that feels half-baked and lacks as many whimsical/playful ideas as the first.The movie wasn't as fun or meaningful as the first. Even the new characters felt gimmicky and lazily imported. A children's cartoon and a video game character show up. Sure they were amusing but they added very little to the story, unlike Bingbong in the first.\n\n                    62 out of 109 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "9",
                "Title": "Emotional landscape",
                "Content": "The first part was very successful, with innovative materials and clever angles of entry. Various emotions were personified, and the concrete imagination was unique yet particularly appropriate and reasonable.Therefore, I have a question about the second part: how can the story be made up? Would it be possible for a dog tail to continue a mink? This question disappeared completely when I sat in the cinema and watched for about ten minutes.The entire worries and doubts were swept away, and the new story, in terms of rhythm, characters, plot, and logical direction, is surprising. It continues the bold imagination of the previous part and further expands, with laughter and tears. The whole story is both expected and unexpected. After reading it, not only children but also adults will benefit greatly from it.It has to be said that this sequel once again proves an excellent animated movie, and telling a good story is the key to success. I love this story, I can't wait for the third part to appear!\n\n                    2 out of 2 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "7",
                "Title": "Inside Out 2 is another animated gem from Disney with smart coming-of-age elements that's worthwhile for the entire family",
                "Content": "My daughter and I saw Inside Out 2 (2024) in theaters last night. The storyline picks up with Riley wrapping up middle school and preparing for high school. She's excelling in hockey, and she and her friends are selected to attend a hockey camp. However, she discovers her friends won't be going to her high school and meets some new girls who will. She begins experiencing new, strange emotions while navigating this transition and going through puberty. How will her old emotions handle the surge of new emotions to help Riley through this adjustment period?This film is directed by Kelsey Mann, in her directorial debut, and features the voices of Amy Poehler (Baby Mama), Maya Hawke (Stranger Things), Phyllis Smith (The Office), Lewis Black (Man of the Year), and Kensington Tallman (Drama Club).This is such a smart animated series with valuable lessons and real-life scenarios that resonate with everyone as they journey to adulthood. It cleverly illustrates how emotions evolve and how one's old and new selves adjust as responsibilities increase and life lessons are learned. The storyline is excellent. We saw this film in 3D, and the animation was stupendous. The hair and texture looked so realistic, you felt like you could reach out and touch them. There's so much to love in this animated gem.In conclusion, Inside Out 2 is another animated gem from Disney with smart coming-of-age elements that's worthwhile for the entire family. I would score this a 7/10 and strongly recommend it.\n\n                    9 out of 12 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            }
        ],
        "Directors": [
            "Director",
            "Kelsey Mann"
        ],
        "Writers": [
            "Meg LeFauve",
            "Dave Holstein",
            "Kelsey Mann"
        ],
        "Stars": [
            "Amy Poehler",
            "Maya Hawke",
            "Kensington Tallman"
        ],
        "Details": {
            "Release-Date": "June 14, 2024 (United States)",
            "Country-Origin": "United States",
            "Language": "Instagram - Pixar's Announcement"
        },
        "BoxOfficeDetails": {
            "Budget": "$200,000,000 (estimated)",
            "Gross US & Canada": "$356,393,666",
            "Opening weekend US & Canada": {
                "Collection": "$154,201,673",
                "Date": "Jun 16, 2024"
            },
            "Gross worldwide": "$728,993,234"
        },
        "name": "1. Inside Out 2"
    },
    {
        "movie_name": "Hit Man",
        "movie_imdb_id": "/title/tt20215968/?ref_=sr_t_2",
        "YearDuration": [
            "2023",
            "R",
            "1h 55m"
        ],
        "Ratings": [
            "6.9",
            "/",
            "10"
        ],
        "ReviewRelatedInfo": [
            {
                "User reviews": "291"
            },
            {
                "Critic reviews": "168"
            },
            {
                "Metascore": "82"
            }
        ],
        "FilmPlot": "We've pulled together all the big (and small) summer movies to keep on your radar, including Kevin Costner's two-part western, Eli Roth's video game adaptation, and a remake of the '90s goth classic, The Crow .",
        "UserReviews": [
            {
                "Rating": "6",
                "Title": "Good, yet somehow far from great",
                "Content": "It is a good movie for a lazy Saturday evening, entertaining enough to keep your attention throughout and go to bed with a half-smiled satisfaction. Nothing less, nothing more. A lukewarm experience.It's even, consistent, but never warms up to 30 C degrees or over. I guess that was intentional given the real life implications of the story. It might have been more exciting at times, even frantic in certain scenes, but it wasn't. What a pity.From a movie making point of view, it is almost impeccable. Good direction, simple but effective camerawork, good score and editing, and most of all, superb acting makes it a good and quite joyful watch.If you look for a light entertainment, there you go. You can leave your brains at home. No worries.\n\n                    75 out of 92 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "6",
                "Title": "Not As Clever As It Thinks It Is",
                "Content": "The premise is very good: a mashup of romcom and noirish thriller in the vein of Notting Hill meets Double Indemnity. It should provide all sorts of setups for dark comedy and the means to upend both genres. Unfortunately this movie skews too far in the direction of romcom. There's a funny prelude in which Glen Powell showcases his comedic chops under the guise of various personas. After that the the movie becomes an extended one-note joke in which the gag is simply that it's a romcom with horrible people as the protagonists. The idea wears out its welcome long before the movie ends and otherwise not a whole lot happens.\n\n                    53 out of 68 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "6",
                "Title": "It is a banausic Rom-Com, sans the comedy, with overplayed plot",
                "Content": "This was billed as a quirky, clever Rom-Com by both its trailers and critics. The trailers looked fantastic, like a spirited passion project between Linklater and Powell that would parody the whole Rom-Com genre in witty fashion. The reality is this is just another Rom-Com film with critics falling head-over-heels with Linklater (as they always do). The most interesting part of the film is actually the first act, when Glen Powell gets to shine in a diverse portfolio of characters, including a long, gritty dialogue exchange. By the time the love interest appears in the second act, the film has already fallen into just another collage of good cop/good person/bad circumstance entanglement. Unfortunately the film never really redeems itself, nor its characters in unforgiveable acts. Its story feels mundane and outcome certain. While I had hoped for more, it was at least an easy viewing.\n\n                    97 out of 132 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "6",
                "Title": "Don't believe the hype",
                "Content": "Just before this was released, the press and social media were awash with reports of 'Hollywood finding it's new lead man in Glen Powell' in this rotten tomatoes critical 'smash hit comedy' that was one of the 'best films of the year so far'I believed the hype.What I got was an overly long film that, shockingly considering it's promising opening act, was really devoid of any fun. Sure Powell is OK, but he completely implausibly goes from mild mannered college teacher to actor extraordinare using his range of disguises and accents to convince people he's a serial killer.I also like the Superman like 'oh he's so hot now he's taken his glasses off' transformation.It's just all so lazy, unbelievable and bland.Anyway. It's not terrible, it's mildly entertaining but definitely undeserving of it's praise.\n\n                    78 out of 107 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "6",
                "Title": "So Close, Ruined by Consistent Illogic",
                "Content": "So much of the dialogue contradicts itself, so many of the characters actions make no sense. The plot had so much potential based on the setup, but the female lead is utterly unlikable and you never feel sympathetic or even like she's a real person.This could have been cool, about him actually becoming a hitman, him involved with the husband's mobster family, etc. Instead it becomes a typical and predictable plot. Such a bummer and was so close.This paragraph is just to make my review long enough for the new six hundred character requirement instituted because Amazon's $1Billion snow ranked and got bombed on this site. Hopefully they change it back because this is a waste of my and everyone else's time for quite literally seemingly absolutely no reason. Boom six hundred characters.\n\n                    100 out of 144 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "8",
                "Title": "Much better than I was expecting based on the trailer",
                "Content": "In a world of Hollywood formulas and studio safe bets, there's something refreshing about Hit Man and it's quirky out of the box story.It follows Glen Powell as the eponymous Hit Man who gets into a complicated relationship with one of his clients. I won't go into any more detail as there's lots of fun layers to unravel with this film which are best discovered in the moment, but as mentioned it feels quite fresh and unique. It has really solid comedy, drama and romance, and will keep you on your toes throughout.Rising to occasion of the great story is Glen Powell who shines once again in a leading role. His charisma always shines through and there's an instant connection to him and his character that never wanes. Matching him perfectly is Adria Arjona, the chemistry between them absolutely electric.My only real complaints with this film are that it took too long to get going and was over far too quickly. Aside from these pacing issues there really isn't much to complain about with this film.So if you are in the mood for a funny, sexy and dramatic film that will draw you in to it's weird and mysterious story then look no further than Hit Man.\n\n                    108 out of 147 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "7",
                "Title": "Fun watch but could've been better",
                "Content": "First thing's first: Glen Powell is incredible in this movie. He transforms across the spectrum of characters incredibly well. He's dynamic and believable in this role that boarders on absurdity and keeps it in bounds.The premise of the story was entertaining and engaging, with an enjoyable secondary cast.Adria Arjona was also fun, but her character could've better developed. The high octane romance tag transpires feels entirely too surface for how emotionally involved it becomes in the end. There were no flashes of actual connection beyond sexual intensity and discussion about murder. It would've been nice to see them have at least one \"get to know you\" interaction outside of the sex-murder dichotomy.The ending is also.... Unnecessary. Maybe for laughs amongst the people who knew the real Gary Johnson, but for storytelling purposes it was a little too campy.An entertaining watch, one of Netflix's better recent films. But it does fall a little flat in a couple places.\n\n                    26 out of 34 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "8",
                "Title": "darkly quirky and very entertaining",
                "Content": "If you enjoy quirky movies, director Richard Linklater is your guy. His latest is HIT MAN, which is a romantic comedy that's very loosely based on an article about a real guy, Gary Johnson. Gary (Glen Powell) is a college professor and part-time staffer at the New Orleans Police Department. He stumbles into a new role as an undercover hitman, arresting people who try hiring him to kill someone. It turns out he's very good at it. Powell really showcases his talents here, playing different characters for each arrest. When he meets Madison (Adria Arjona) though, he breaks protocol. I guess Powell has great chemistry with whoever he works with. He has an undeniable charm that seems like it spreads to the whole cast. I could tell they had fun filming this. It also has a very smart script, playing with ideas of identity and being your true self. The strong sense of humour actually changes as the movie progresses, which was fun for me, but might not work for some. I find it hilarious that they must've asked the real Gary Johnson for permission to go as far as they do here. The movie makes it clear what actually happened during the end credits. HIT MAN is quirky, unconventional, and very enjoyable. If you can't see it in theaters, don't worry! It'll be on Netflix June 7th. Make sure the algorithm doesn't bury it. Enjoy!\n\n                    59 out of 92 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "6",
                "Title": "Hit Man is a mystifying bore-fest",
                "Content": "Glen Powell was blah in his last \"big\" movie, \"Anyone But You\". Here, things don't improve, although this time his female costar is just as extravangantly luscious as Sydney Sweeney, only brunette. His character, Gary Johnson dresses up in wigs and hats and costumes and assumes accents and personas to convince qould-be criminals that's he's a real hit man, but only they believe him - the audience certainly doesn't. One critic, Jason Fraley, describes the rom-com arc of the plot as \"Fifty Shades Of Gary\". The film is emotionless and gutless and packs zero punches. I kept waiting to laugh or be intrigued or moved or something... but nope, nothing/\n\n                    53 out of 79 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "6",
                "Title": "Hit Man Misses the Target",
                "Content": "Richard Linklater's movie career has been punctuated by intense and innovative stories originating from everyday events. 'Hit Man' somehow achieves the opposite - it's a fluffy confection inspired by the real-life exploits of a psychology professor who poses as a professional hit man.The purpose of Gary Johnson's masquerades is to help his police department entrap those looking to hire a killer. The film's introductory sequences show several improbable restaurant encounters where he convinces a procession of would-be murderers he's a hardened criminal in the liquidation business. These meetings are recorded, and the conspirators arrested after clearly stating their intent and handing over a down-payment. Linklater's narrative departs from reality and credibility when a beautiful Latina asks him to terminate her abusive husband. To the confusion of his handlers, Gary refuses her payment, and suggests she initiate divorce proceedings instead of contracting a homicide. Needless to say, complications ensue when he secretly starts an affair with her while maintaining his assassin persona.'Hit Man' could have followed in the footsteps of modern classics like 'Body Heat', but Linklater chooses to play it for comedy rather than drama. Tension is lost as the proceedings become increasingly absurd and frivolous. The acting performances and lightly amusing screenplay just about hold one's interest, but the end-result feels like an insubstantial appetizer that could have been a memorable main course with a different approach.\n\n                    15 out of 20 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "9",
                "Title": "\"Chivalry may be dead.. but I didn't kill it\"",
                "Content": "Well, I'm a little shocked.They tagged this as \"Action Comedy Crime\", and I think only the Crime label fits it. It is more Psychological than Comedy, and it is is more Romance than Action.It's not entirely \"hilarious\", and I was just thinking about how a movie can be this engrossing without \"adrenaline-fueled\" sequences at all.. But what it is, it's a tremendously well written and executed script. With plenty of memorable lines, unexpected \"commitment\", and even introspective lessons. Glen Powell is simply amazing in it. He's demonstrated a lot of charm, but we now got to see quite a bit of range as well. Even his disguises. The rest of the cast helps sell it. And the ending was quite satisfying, even if I didn't entirely expected it!The great pacing takes you along and you start to accept the path you are walking alongside these characters. Haven't watched a recent movie that makes me want to recommend this to everyone I know.. kind of has a Mr Brooks vibe to it.\n\n                    36 out of 58 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "7",
                "Title": "A surprisingly entertaining comedy with great chemistry",
                "Content": "I went to see this movie on a whim, mainly because I wanted to go to the cinema and had already seen everything else that was playing. With low expectations set by the unremarkable trailer and poster, the film pleasantly surprised me. Glen's performance was commendable; he effortlessly slipped into various character roles, eliciting genuine laughs along the way. The chemistry between Glen and Adria is fantastic. Although it includes some clichéd romcom moments that were a bit predictable, the infusion of philosophical insights provided an unexpected layer of intellect, elevating the overall experience.\n\n                    46 out of 73 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "9",
                "Title": "Glen Powell Puts on a Show, Hit Man is a Riotously Funny and Intriguing Dark Comedy",
                "Content": "My first experience with Glenn Powell was his supporting role in Top Gun: Maverick. He's been around much longer but he was good at playing the brash and cocky Hangman. He's been noteworthy in previous efforts (Hidden Figures was also mentioned by one of my friends) but I was blown away by his work in Hit Man, not only is he fantastic as the suave and smooth Ron but he's also convincing as the reserved and stale Gary (I do have some thoughts on how they present Gary, more on that later). But watching him in Hit Man, it felt like I was watching someone doing acting gymnastics, he's playing so many different and bizarre characters and he nailed every single one. He also has great chemistry with his co-star Adria Arjona, I was just as interested in the their torrid romance than I was in what costume Gary was going to shuffle into next. Speaking of Adria, her work in this was also noteworthy, it would have been easy to make assumptions about Madison's character if Adria's performance didn't make her so mysterious and alluring. She's beautiful, she got her fair share of laughs from me and I was surprised at how invested I was in Gary and Madison's relationship by the end of the movie. I also wanted to credit Austin Amelio, Retta and Sanjay Rao for their collective work in their supporting parts. Another expectation the movie subverts is painting Jasper as a two dimensional villain, Austin makes Jasper unlikeable but not inhuman or not believable as Gary's dejected co-worker.Besides the performances, my favourite part of Hit Man was how it subverts the formula. I can't call it wholly and completely original but I was constantly trying to guess the next twist or shift in the narrative based on similar films. Hit Man continued to zag when I expected it to zig and it's so well layered. Director Richard Linklater and his team have a sense of when they need to switch things up, just when the movie gets too goofy, we get more time with Ron & Madison bonding or when you're about to guess when a twist will happen, the movie will suddenly get much darker. There's several tones at play but they are mixed together so precisely that it kept me entertained when I feel like another movie would have lost me.So many movies are \"based\" on a true story and sure enough, Hit Man isn't the unvarnished truth up on the screen. But the movie is cognizant of the fatigue that comes with this claim and admits it upfront. It helps that the true story is so fantastical that I wasn't bothered in how they tweaked it. Despite the changes, Hit Man is so good natured and seems to being celebrating Gary's unbelievable skill set that I didn't get bogged down in what was true and what wasn't.Hit Man slowly builds toward the finale and despite climax being morally murkier and darker tinged than I maybe expected, I loved how the ending punctuated what was a hugely enjoyable film. I was rooting for Gary/Ron and Madison despite what was revealed about them and it's captured wonderfully by Linklater. The movie doesn't pause to scold you for being sympathetic to one party or another and I liked that it wasn't too concerned with the absolute morality of the characters. The film ends with a metaphorical wink to the audience and it felt like a chef's kiss on a delicious meal.I'm going to be brief about any griping, My only problem is that they don't do a wholly convincing job of dressing Glen Powell down to be the nerdy and shy Gary Johnson when he's just being himself. It's reminiscent of sitcoms slapping glasses on models to trying to present them as dowdy. When everyone is making jokes about how \"normal\" and \"unassuming\" Gary looks, I rolled my eyes a little. But I guess Glen Powell being too handsome to be terribly convincing as a geek college professor is a nice problem to have.Hit Man was such a pleasant surprise, I felt like I was taking a gamble taking friends to see it in the theatre with me but we all walked out impressed. It made me a little sad that it was simultaneously released on Netflix, this is a theatre quality movie and while I understand it might have had a tougher road to profitability than your typical summer tentpole, it earned my ticket price. The film is so much fun, Glen Powell and Adria Arjona light up the screen and the fact that it's based on a true story is just delightful (I loved the end credits joke on how they changed the story). I tip my hat to Powell, Linklater & his team and the real Gary Johnson, I had a great time with Hit Man. I'd rate this at an 8.5/10 rounding up to a 9/10 and while you should check it out on Netflix, you won't regret going to see it in theatres either.\n\n                    21 out of 34 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "8",
                "Title": "Finally a good comedy movie",
                "Content": "Well we had some tough comedy movies in the past but this is one is good. It made me think about 'the millers', it has a little bid the same comedy vibe. Just good jokes and even better acting. It just all fits. Not only the lead but also the crew around it.Besides comedy the movie is also a little bit mysterious. You keep wondering what got the lady to do with it and can she be trusted?Plot was decent too! Not some unrealistic without idea just to end the movie script.. no it actually fits with the whole movie and is original.Maybe there was more possible with the teaching scenes on school.. that was sometimes a little bit duff but argh.. i didnt mind it that much.So yeah.. had some good laughs.. i go wild and give it a 8.\n\n                    53 out of 98 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "6",
                "Title": "Hitman: A Mixed Bag of Charm and Missed Opportunities",
                "Content": "\"Hitman,\" directed by Richard Linklater, is an intriguing yet uneven journey that offers glimpses of potential but ultimately falls short of being a memorable cinematic experience. Based on a true story, the film features commendable performances, particularly from Glen Powell, but suffers from a lack of character development and emotional depth.Glen Powell delivers a standout performance, embodying his character with a mix of charm and authenticity that makes him a compelling figure to watch. His nuanced portrayal brings a layer of believability to the narrative, making the moments of action and subtle humor particularly enjoyable. Powell's ability to infuse his role with both intensity and a touch of levity is one of the film's highlights.The movie does offer a few humorous moments that provide a welcome break from the otherwise serious tone. These lighter scenes are well-executed and add a layer of entertainment, making the film a decent choice for those looking for a casual watch. However, the humor alone is not enough to compensate for the film's more significant shortcomings.One of the primary issues with \"Hitman\" is its lack of character development. Despite the film being based on a true story, the characters feel underdeveloped and one-dimensional. There is a noticeable absence of emotional depth, which makes it difficult for the audience to connect with or care about the characters on a deeper level. This lack of character growth and exploration is a missed opportunity that could have elevated the film from being merely good to something truly impactful.Richard Linklater's direction, while competent, fails to fully capitalize on the story's potential. The narrative feels rushed at times, and the pacing issues detract from the overall impact of the film. There are moments that hint at deeper emotional and psychological layers, but these are never fully explored, leaving the audience with a sense of incompleteness.In conclusion, \"Hitman\" is a film that is good for passing the time but doesn't leave a lasting impression. Glen Powell's strong performance and the film's occasional humor make it worth a watch, but the lack of character development and emotional depth prevent it from being anything more than a mildly entertaining diversion. With a more nuanced approach to storytelling and character development, \"Hitman\" could have been much more impactful.\n\n                    9 out of 12 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "3",
                "Title": "Storytelling struggles for over an hour, slightly improves, then crashes hard",
                "Content": "A tragically dumbed-down misfire on every level. It is set in New Orleans, everyone talks like they are from Iowa. No local flavor from the the setting, which is weird - why choose NOLA then never use it in any way that enhances the film? The story is absurd and really very inane. Nothing in this is slightly funny, and it becomes witty and actually engaging for exactly one scene. The rest of this is borderline awful. The actor is smarmy and kind of a cross between Ryan Gosling and Christian Slater - neither of whom are all that great on their own. The situations shown are ridiculous and always look 100% scripted and nothing whatsoever like the way life on this planet actually occurs. The first entire 2/3 of this is a slog and a jumble of implausible and boring events, the it rises very slightly and briefly when the aforementioned One Good Scene occurs, only to divebomb very hard into a completely incomprehensibly ruinous ending. Bad storytelling, bad direction, bad script, The actors do their jobs well, but with so little to work with. A truly lightweight piece of product from an \"artist\" director. Not a proud moment for him, not in the slightest.\n\n                    37 out of 39 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "6",
                "Title": "Mildly amusing but overly slight",
                "Content": "Being a huge fan of Richard Linklaters work, I had high expectations for his latest feature Hit Man, but by the time the end credits rolled, I could not help but feel a strange taste in my mouth. There is no doubt that Hit Man is a fun, maybe even entertaining, film at times. Seeing the magnificent Glenn Powell navigate the different personas he create for himself with considerable ease and suaveness is a great joy. But while this undercover average Joe turned hit-man idea may serve as an interesting premise, the film does not develop much from this premise meaningfully. The plot is overly slight, and the direction it goes is bizarre, especially the ending, which felt rushed and contrived. The plot does not develop in a manner which extracts full potential of comedy from its situation, and neither is it particularly entertaining. Also, Despite what some critics have praised, I could not see much chemistry between Arjona and Powell. Sure, they are both more than serviceable in their roles, and they share several steamy scenes, but there is no special spark or unique connection between the two. At the end of the day, I find Hit Man very similar to The Fall Guy, a movie released at around the same time. Both are serviceable, fun, and entertaining distractions which can barely hold and audiences attention for two hours. But both are overly light on actual plot, are only mildly entertaining, and not as funny or enjoyable as they should have been.\n\n                    7 out of 9 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "6",
                "Title": "Elevated Hallmark with a fine spice of comedy and honesty..",
                "Content": "Hit Man delivers a funny and entertaining movie that is more than your average rom-com. The movie ultimately is great for anybody looking for a nice movie to watch. While I don't exactly find it really good and just find at a good rom-com flick, Hit Man offers a more respectable approach that is a nice change of pace of various \"Based on a true story\" movies. Instead of trying to make it seem like all the events in the movie happened in real life in a deceiving manner, Hit Man, based on a real person, openly states the inaccuracies in the movie that are much different from real life events. I find various movies these days don't offer this type of respect to real people or events and the idea of adding fantasy elements and blending them with reality results in some people believing it entirely. This results in a different view towards certain real people and events, which is all just very manipulative and upsetting. While this isn't really that big of an issue (except when it's done a problematic way, such as disrespecting loss of life, tragedy, etc.) but I really do appreciate Hit Man's honesty about it. I absolutely recommend Hit Man as a fun watch and I do love how respectful it is to the real people it's based around.\n\n                    22 out of 40 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "8",
                "Title": "I actually laughed",
                "Content": "That is rare. Well, I often laugh at the movie, but this time I definitely laughed with the movie, which happens only once every blue moon.For context, I'm not the biggest fan of Richard Linklater. I generally find his movies to be okay at best, but this one I did really like. We have a nerdy main character I can definitely relate to as a fellow nerd and a fellow educator.I did not really know who Glen Powell was before this. I had seen some movies he has a role in, but as he has been more of a character actor, I wasn't really aware of him. Here, he can kind of use that. He is supposed to be forgettable and learn to be something else.Powell also co-wrote the movie, his first feature as the writer. The story is nothing special. It's kind of obvious after the premises, but it does work nicely as something to hang all these jokes on.It doesn't really fall into copaganda either, which is a rarity.\n\n                    42 out of 81 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "6",
                "Title": "looked like rom-com",
                "Content": "For some reason I thought this was going to be something like a noir and funny. Oh dear, for about the first half hour I wondered if it was really going to be this silly and dull. Then it changed I couldn't believe it, looked like a rom-com but then it changes again and it seems to stop, as I did I wondered how it was going to happen and my wife thought something else. Either of our ideas would have been better and it really does turn into unfunny romance. Only the other day I picked up a £1 DVD in a charity shop I'd never heard of it, Beautiful Creatures (2000) and it really was like a noir and it was very funny and it had an early one of Rachel Weisz which was wonderful. Those killers were really scary but in the Hit-Man they certainly were not but surely they were supposed to, or maybe not.\n\n                    7 out of 10 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "8",
                "Title": "Glen Powell IS Gary Johnson",
                "Content": "Glen Powell skillfully settled into the role of Gary Johnson in Netflix's 'Hit Man', with Linklater finding a nice blend of solid acting work and an investing murder mystery to keep the entertainment consistent throughout. Adria Arjona knows how to compliment Powell's quirky charm perfectly and the meticulous pacing makes the film feel like a breeze to watch. The movie has witty comedy, steamy romance, and an all around engaging atmosphere to keep you more than satisfied throughout its runtime. Fans of Richard Linklater's work can sleep well knowing there's yet another gem in his latest offering.\n\n                    8 out of 12 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "7",
                "Title": "Hit Man",
                "Content": "At this rate, Glen Powell is going to be able to pay Tom Cruise back for his flying lessons pretty swiftly! Here, he's a rather geeky teacher (Gary) who teaches philosophy at a college whilst occasionally helping out the cops with some criminal profiling. When one of their investigators \"Jasper\" (Austin Amelio) goes a bit too far and gets suspended, Gary gets drafted in last minute and proves quite effective at getting folks who want to bump of their nearest and dearest for $5,000 to admit their cunning plans to a well wired-up con. The more of these cases he does, the better he gets; the more fun he has dressing up and adept he becomes at assuming a range of identities. It's \"Maddy\" (Adria Arjona) who sets the cat amongst the pigeons when she asks him to get shot of her thuggish husband \"Ray\" (Evan Holtzman). He takes a shine to her and talks her out of her criminal ploy. Quickly the two are seeing each other - which is manna from heaven for the deposed \"Jasper\". When her husband is found dead, he thinks he knows exactly who did what and how best to exact his revenge... It's quite an entertaining romantic thriller this, providing Powell with an opportunity to charm his way through an almost two hours of cinema that is light and fluffy, completely preposterous yet based on a true character. Arjona looks like she is having a good time here, too - and the last twenty minutes are quite fun. No, it won't trouble a BAFTA jury I suspect - but it's quite enjoyable summertime fayre.\n\n                    19 out of 36 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "8",
                "Title": "Descending into the depths of Dionysus",
                "Content": "The hitman is already for a long time a popular character in crime and (neo) noir films. For me the ultimate hitman-film is \"The day of the jackal\" (1973, Fred Zinnemann). In this film Edward Fox plays a hitman that is professional, emotionless and a typical loner.Only the last description does apply to Gary Johnson (Glen Powell) in \"The hit man\". He is however not a real hit man but an undercover hit man. He meets people looking for a hit man and makes sure the compromising evidence is on tape.In order to do this he changes outfit all the time and this leads to a comic costume parade, including an imitation of Anton Chigur (Javier Bardem), the hit man from \"No country for old men\" (2007, Ethan & Joel Coen).Being partly a comedy, \"Hit man\" is an odd one in the oeuvre of director Richard Linklater, who is mostly known for his \"Before .... \" relation trilogy (1995, 2004,2013) and his coming of age film \"Boyhood\" (2014).\"Hit man\" really takes of when Gary Johnson falls in love with one of his clients (Maddy Masters played by Adria Arjona). It is the starting point of a roller coaster of numerous unexpected twists and turns.One of the themes is losing sight of the difference between your undercover \"me\" and your real \"me\". It happens in numerous film, but it also happens in reality. In an investigation from 1994 - 1996 the Dutch parliament studied how it happened by the police while combatting organized crime.The fact is however that Gary Johnson has two real \"me's\", one as a part-time police officer and one as a professor in philosophy. The last one delivers the philosophical theme of the movie of how to find a satisfactory balance between ratio and discipline (represented by the Greek God Apollo) and feeling, emotions, instincts and living dangerously (represented by the Greek God Dionysus).Remarkable is that where his most famous films (The \"Before\" trilogy and \"Boyhood\") are typical for an Apollonian world, \"Hit man\" descends to the depths of Dionysus.By the way, \"Hitman\" is in my opinion not very flattering for women, showing how they prefer the sex appeal of a hit man to that of a \"dull\" police officer (let alone a nerdy professor).\n\n                    32 out of 65 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "7",
                "Title": "Amiable, entertaining, but the ending was a letdown",
                "Content": "I'd never heard of Glenn Powell before this film and I must say he was charming, handsome, likeable, confident, funny, and a true star. There are maybe three other male actors right now in this category: George Clooney, Ryan Gosling, and Brad Pitt. Powell makes this movie work, his easygoing affability papers over the movie's contrivances and wobbly morality, and distracts from Linklater's bland, almost TV-movie like set-ups and blocking. Linklater's best films-Slacker, the Before Trilogy, Boyhood-present a consistent visual style, but most of his work is interchangeable with any number of directors-for-hire.\n\n                    5 out of 7 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "2",
                "Title": "Not an Action Rom-Com",
                "Content": "The only time i laughed in the movie was when the lady lawyer was defending the first criminal and putting all the blame on Gary in the name of the humanity. That's it.The movie had a slow build up, giving u insight bout the undercover work Gary was doing and it is a noble cause, stopping a crime but from the moment the romantic lead entered, the movie derailed. And the ending kinda took out all the good things (however much measly amount they were) away for sure. Because these things surely will give hope to someone that u can get away from a wrong doing and live happily ever after.As for acting, Glen really has the unreadable face with one or two expressions which worked in his favor in this movie. But Adria. You know those actresses in B or C grade movies where their acts immediately tell u they are fishy and acting and with no subtlety trying to pry information outta u and batting eyelashes to make u do something, her acting in this movie belongs in that category. Anytime she was on screen, i had to endure a fake performance.There was barely any action, any comedy and romantic romance, so defining which genre this one belongs to is hard. But calling it a Rom-Com will be a huge disservice to the genre and insult to the original Rom-Coms.\n\n                    17 out of 17 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            }
        ],
        "Directors": [
            "Director",
            "Richard Linklater"
        ],
        "Writers": [
            "Richard Linklater",
            "Glen Powell",
            "Skip Hollandsworth"
        ],
        "Stars": [
            "Glen Powell",
            "Adria Arjona",
            "Austin Amelio"
        ],
        "Details": {
            "Release-Date": "June 7, 2024 (United States)",
            "Country-Origin": "United States",
            "Language": "English"
        },
        "BoxOfficeDetails": {
            "Budget": "$2,257,688"
        },
        "name": "2. Hit Man"
    },
    {
        "movie_name": "Bad Boys: Ride or Die",
        "movie_imdb_id": "/title/tt4919268/?ref_=sr_t_3",
        "YearDuration": [
            "2024",
            "R",
            "1h 55m"
        ],
        "Ratings": [
            "7.0",
            "/",
            "10"
        ],
        "ReviewRelatedInfo": [
            {
                "User reviews": "240"
            },
            {
                "Critic reviews": "157"
            },
            {
                "Metascore": "54"
            }
        ],
        "FilmPlot": "From epic stunts and mind-blowing effects to heart-racing stories and memorable characters, here's the latest in action movies and series.",
        "UserReviews": [
            {
                "Rating": "8",
                "Title": "Great come back.",
                "Content": "So I was left a little disappointed after the last film, something just seemed to be missing but this really hit the spot.The 2 central characters still have great chemistry, but this felt a lot more like an ensemble piece with more fleshed out characters around them. I'm just going say #Reggierocks.Some great cinematography with lots of fab camera and drone work zooming around all over the place. The first person gun work at one point added a new dimension.Miami looks beautiful with the Orange and Teal tones.Action galore and a good protagonist in Eric Dane, although his motive and why he is doing what he is, was pretty rubbish, but he still played it well, and to be fair you don't come in to this sort of film hoping for Shakespeare level story telling.Some fun cameos pop up which raise a smile.The soundtrack is good and Lorne Balfe delivers on the orchestrated score.It has all you would expect from a Michael Bay production. Definitely life still in the franchise.\n\n                    101 out of 133 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "8",
                "Title": "\"You're my bad boys. Now clear my name.\"",
                "Content": "The fourth entry in the revitalised buddy cop, action, comedy franchise. Bad Boys: Ride or Die sees wisecracking Miami cops Mike Lowrey (Will Smith) and Marcus Burnett (Martin Lawrence) embark on a dangerous mission to clear the name of their late police captain when he gets linked to drug cartels.Firstly, they missed a trick not calling this instalment Bad Boys 4 Life, alas we cannot have everything we desire. Anyway, it was inevitable that we were going to get a fourth (and potentially fifth) as 2020's actual Bad Boys For Life made nearly half a billion dollars and due to the pandemic, was in the top 3 highest grossing of that year.It has been too long since I watched the first film (it is long, long overdue a rewatch), however Bad Boys II I return to every couple of years when I require a dousing of Bayhem. Has it aged well? Nope. Is it obnoxious and overlong? Yes. Does the action rule? Hell yes! The third film I found solid, yet disappointing, it lacked the grit and sleaze of its predecessor and incorporated a bizarre supernatural element that didn't quite click.This was a real step up from three and balances the slick, modernised lega-sequel of the previous film with the sleaze and chaos of Bay's entries. Admittedly it's a little bit of a rushed and rocky start and narratively the film isn't bringing anything particularly new to the table, yet it's clearly relishing its heightened mid-00's vibes. Once Marcus returns a from death's embrace with a new outlook on life and spirituality and Mike's fears for his family, his own mortality and a reconnection with his fugitive son come to the forefront of his anxieties, the film adds a surprising layer of character work that still manages to incorporate dick jokes and f-bombs aplenty.Action-wise this boasts some of the franchise's best set pieces. Director's Adil El Arbi & Bilall Fallah certainly lean a bit heavier into the Bayism's here than in BBFL. A slow-motion, sped up and gloriously chaotic digital, neon tinged art exhibition shootout is very Bay. A superb John Wick-esque home invasion shootout (featuring a well deserved triumphant moment for a fan favourite character) and the *entire* finale section of the film is a bar setter for shootouts this year. The incorporation of first person POVs, drones, alligators, explosions aplenty mix together for a riotous bloody blowout.Performance-wise this was certainly the best way Will Smith could properly return after the Oscars controversy (I know he had Emancipation a few months after the incident, but I don't think anybody apart from me watched it). His more vulnerable and subdued fatherly moments as Mike are well executed... as well as the kick ass swagger that established the character. However, it's Martin Lawrence that steals the show. A motormouth, wide-eyed, born again foul mouthed spiritual guide who claims he can't die. He's having a ball and both he and Smith's chemistry is still unbeatable. Supporting players Jacob Scipio, Ioan Gruffudd, Rhea Seehorn and Reggie himself Dennis Greene are all locked in to the material.Bad Boys: Ride or Die was a bullet riddled, cackle worthy blast of throwback fun that was a step up from my expectations. Smith & Lawrence are still a great duo, the action is killer and the balance of soap opera sincerity and over-the-top drama balances effectively with the motor-mouthed bickering and gags. Sure, the plot isn't particularly standout and the film is a little choppy in the first act, but when the wheels begin to fully spin, the film charges off the start line.\n\n                    81 out of 115 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "8",
                "Title": "Another Bad Boys banger",
                "Content": "It must be a lot of fun to write these 'Bad Boys' movies. The two lead characters really are great and they play off each other so well. And even if you wrote something in the script that was so-so, you know you've got a couple of great actors who will make it work. There were a couple of lines in this movie where I thought to myself, on paper that probably wasn't all that funny, but they found a delivery that got a chuckle out of me.There's everything you could want out of a 'Bad Boys' movie in this one. The action is there, the laughs are there, there's a great menacing villain and there are some fun side characters to help carry the load. We are four movies into the series and have yet to see a drop-off in standard whatsoever. Bring on the next one I say. 8.5/10.\n\n                    59 out of 89 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "7",
                "Title": "Great movie",
                "Content": "I do not understand why some people are still at this \"Will Smith\" slap stage. Just get over with it. You don't give 1/10 to a movie like this unless you're dumb and got shot in the head. Yes what he did was bad, but it has nothing to do with the movie nor his actions, cuz remember he's an actor. Remember all these people giving 1/10 are still but*hurt about the slap & are trying to boycott Will Smith for his acting career. I don't want to include any spoilers, The movie is funny got great comedy lines, great acting and the jokes are just too funny so don't lurk around giving weird unrealistic rating just because you don't like the actor in real life. & i'd suggest to watch it for fun.\n\n                    77 out of 123 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "7",
                "Title": "An entertaining and fun action film which whilst set in its ways, makes the most of it.",
                "Content": "The story's nothing special with one-dimensional villains, damsels in distress and the attempts to tie it into previous films is pretty weak, but the Miami setting is wonderful and used very well with exotic nightclubs and an iconic culture. The frequent and frantic action pieces are exciting and intense with enough explosions, violence and good use of clever camera work, constantly jumping between different views of the scenes. The characters are funny with plenty of jokes and humour as they make fun of themselves and each other whilst accepting they have aged. A couple of good cameos and an ok run time, but the choppy editing is noticeable at times.\n\n                    8 out of 18 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "9",
                "Title": "Haven't had fun like this watching a movie in a long time",
                "Content": "I have always been a fan of will and Martin ever since the fresh prince and Martin show. This movie was so fun, I laughed so hard and the audience in general too. Action packed and some scenes were shot in a way I never saw. Congrats to the filmmakers adil and Bilal which are from my city Brussels in Belgium. They gave their own twist and flair to this and the last bad boys and I hope they keep coming. I watched the premiere 2nd of June and now I'm re watching the old ones. Probably my favourite action series.Also regi is the goat 😂 annd I love how Martin is more like the badass this time anround, he did a great job. Again, this movie is awesome and I will be watching it many more times.\n\n                    90 out of 124 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "7",
                "Title": "Hopefully no more",
                "Content": "That's not to say this franchise has overstayed its welcome, no. But this movie feels like it has exhausted its last bit of entertainment without coming across as unnecessary. And that's a good thing.Out of the four Bad Boys movies so far, this was probably the one I enjoyed the most. It maybe also has to do with the fact that this was the first Bad Boys movie I've watched in the big screen, naturally making the experience more exciting and memorable, but I also feel like the movie has a lot to make it likeable - be it the rather cliché but effective script, the callbacks, the action, the excitement and most of all, the amazing chemistry between Will Smith and Martin Lawrence.Overall, the movie is pretty fun and while not all jokes land, it's still decently funny and entertaining at the same time.\n\n                    17 out of 46 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "9",
                "Title": "Best of the tetralogy!!!!!!",
                "Content": "Movies was unbelievable from start to finish. Definitely was the best of all 4 films!!! Anyone rating it under a 7 is Definitely a rating killer. I'm very hard on rating movies! I'm against all cheesy films! I will not go to the movies if the film is a below 7!! I cried laughed throughout this movie! I didn't go watch any of the previous bad boy films in theaters. This one is a must see!! Don't listen to these people who rated the new mad max film a 7 or 8.... please dont!!! I didn't expect the movie to move me the way it did... Sheeesh! I watched it in Dolby and felt even bit of action in this film. MUST SEE!!!\n\n                    34 out of 56 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "6",
                "Title": "Good jokes but same old stuff",
                "Content": "Martin Lawrence totally killed it here but I do believe Will Smith is still affected in his acting due to his slap incident (or perhaps his charm is gone).Same old story (good guys get set-up by bad guys and they win in the end). Jokes were ok but I don't think I want to see Will Smith ever again on the screen (he was once a favorite actor of mine).Supporting cast was lackluster as most people have said. And some scenes were fun but the story overall was very predictable (specially who the bad guy is which you can figure it out in the first 20 minutes or so).I love action films and comedy, this used to be a great movie series but I think Will Smith should consider retiring and let his glory days be gone...\n\n                    10 out of 24 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "8",
                "Title": "Barrel of laughs and action packed",
                "Content": "Bad Boys is back and it's so much fun, action packed and hilarious! More Martin Lawrence than the last one had which I really loved cause he was hilarious in this one too and so many types of jokes in this! Martin also had a really funny shootout scene involving food. Action was badass with the great choreography the last one had and more of that brutality too with bloody heavy hitting scenes, one scene I thought I was watching John Wick! There is probably one scene I wasn't keen on which is when someone has an out of body death experience, didn't match the grounded story. But the rest of the story was thrilling and connected to all the past bad boys films which I can appreciate it more for that, especially seeing the relationship between Mike and his son. Mike had some more character work with his panic attacks and even Marcus showing age and toll of the job they do. Final showdown was epic with tons of action with some really unique stuff to have fun with. Music they used too was really epic of course \"Bad Boys\" song but the song \"Tonight\" was really awesome and the use of those songs made it so much more amazing! Some really interesting camera angles especially during the final face off and as a wannabe cinematographer I appreciate them trying new things and seeing them work. It's good to see actors such as Rhea Seehorn, Eric Dane and Ioan Gruffudd in more roles too! There is also a Michael Bay cameo which was pretty cool! A great Bad Boys film that is epic on scale, hilarious and action packed fun!\n\n                    38 out of 69 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "0",
                "Title": "The most boring one of the series",
                "Content": "Watched it in Imax in Manchester Vue and it has to be one of the worst written movies i have watched in a few years , sad to see better action flicked movies get bombed like Furiosa ,watched that last week and man what a movie that was after fury road. This movie is worse is many ways compared to For Life.Hopefully this will bomb bad as Fall guy and all too coz this isn't any better than any of those dumb action flicks. Go watch Furiosa guys and do that after watching Mad Max Fury Road, just a recommendation to you'll, and you'll will love it for sure.Now all we wait is for Deadpool and Wolverine hopefully that wouldn't disappoint like so many others this year man.\n\n                    17 out of 48 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "5",
                "Title": "An ordinary action film. Nothing more is to be anticipated.",
                "Content": "Bad Boys: Ride or Die is a fun-fight entertainer with a predicted storyline. It would be incorrect to categorize this film as awful. Let's talk about it using the key components of a movie.Direction: Not too awful. It might have been better with more information regarding the character development, scene continuity, actor dialogue modulations, and setting.Plot: The plot of this film is weak. There are no enhancements over any of the prior stories or materials, and the plot itself is not new.Screenplay: It appears that there is no need to rewrite the screenplay for this film. It may have changed places, attire, and other equipment from the original script.Dialogue: The dialogue in this film is informal and typical given the circumstances. A portion of them are useless.Cinematography: This film emphasizes the use of cameras. Particularly in the action scenes. Not that awful, actually.Acting: Will's entertaining dialogues aren't all that memorable, and his acting is lifeless. Several times, Martin has overacted. That could be the characterization, I don't know. However, something is absent.Editing: The hue and lighting aren't very appealing. VFX and blue screen are provided as usual. For the huge screen, some effects are quite unique. It's interesting to watch fight scenes with musical accompaniment.Stunt: As long as there is minimal usage of blue screens, the stunts in this film are good.Soundtrack: It's alright. The stunt scenes' background music is well-done.Attraction: To put it simply, the Bad Boys movie's entertainment value is \"okay.\" It is not a thrilling, suspenseful action film. A typical action movie, nothing noteworthy to say.\n\n                    36 out of 68 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "7",
                "Title": "You get what you come for",
                "Content": "It's been four years since we were allowed to see the last Bad Boys film. To everyone's delay, Will Smith and Martin Lawrence returned as agents Mike Lowrey and Marcus Burnet. Of course, the first mentioned was discredited at the 2022 Oscar ceremony, after he sold actor Chris Rock a bang for his head after making a joke by his wife. Because the whole world spoke of shame about this, it became a bit quiet around Smith and he has done little more. This fourth Bad Boys film should give his career a big boost again and time will tell if the world has already forgiven Will Smith. In my case, I never blamed him for anything and I thought it was all very exaggerated how everyone reacted. I have always found Smith a good and above all nice actor and nothing has changed at all to date. The third Bad Boys For Life from 2020 is nice, but didn't manage to hit the level of the first two films, I expect the same from this fourth part and that's fine, because this will be a lot of action and humor where entertainment is guaranteed.And that's it, Bad Boys: Ride or Die gives exactly what you expect in advance and offers a tight two hours of pure popcorn entertainment. The film opens with a bickering Mike and Marcus. Marcus has to live healthier for his health, but when the two with screeching tires race across the highway, Marcus really wants to get something to drink. He gets 85 seconds, where Marcus seizes this moment to buy a hot dog and war Skittels within that time, but then the case is robbed. When Mike furiously walks into the case, a gun is immediately pointed at him, but Mike immediately starts whining at Marcus about his eating behavior. Bam! Opening film, something that immediately leaves its mark on the rest of the film. The gradient just fits perfectly with the predecessors and the directors on duty know how to make the course go as it should. Perhaps a point of criticism is the rather dynamic camera work. You may not really realize this at the beginning of the movie, but when the big action scenes come, it sometimes works disturbingly. Especially in the big end fight, where switching to a first person shooter mode, it looks rather cheap shooting. This was already shown in a making off, in which Smith controlled the image with his movements with a camera around his waist or on his arm.The movie is really full of spectacular action and it's impossible for you to get bored. When Mike and Marcus try to purge the name of their deceased chief commissioner, they are forced to work with the captured Armando, son of Mike of course and bad guy in the previous film. Armando is the only one who can identify who is behind the plot. Unfortunately, the shoe is a bit pinching there, because although the writers may have tried to keep the story mysterious where the outcomes should amaze the viewer, the course and the outcome is very predictable and that is a shame. You will actually know quite quickly how or what in the 'trust no one' cat-en-mouse game where you eventually get stuck with a 'see' feeling. That's quite a shame, because this could perhaps have been prevented with some better writing, where you would still have a reasonable surprise to expect, but none of that. You actually see this very often in these kinds of films and of course you don't go there for a heavy plot twist where your mouth falls open, but here a very easy way is chosen to stay honest. Does that affect the film a lot for the rest? No, because as indicated earlier, you just get what you want and what you expect.Bad Boys: Ride or Die is already the fourth film in the series and gives you as a viewer exactly what you expect from it. Will Smith and Martin Lawrence are the bickering police duo again and end up in an explosive situation again. Perhaps a little more attention should have been paid to the story itself, because that is very predictable, but well, because you are constantly entertained, a large part of the audience will be a concern. However, the camera work is sometimes just a little too dynamic, making some things difficult to follow. For the rest, this is just popcorn entertainment from the top shelf and as mentioned you just get what you come for, a lot of fun humor with action, action and more action. If the Belgian directors Bilall Fallah and Adil El Arbi continue to do this, they can still make a few films, because this is just wonderful set your mind on blanc and just watch and enjoy without fuss or other difficult hassle.\n\n                    7 out of 20 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "6",
                "Title": "Let down by an over the top Marcus Burnett",
                "Content": "I looked forward to Bad Boys: Ride or Die as I really enjoyed Bad Boys for Life. It retains a lot of the positive things which have made the past films fun such as impactful action, R rated jokes and family dynamics. That came with a bunch of side characters new and old and an okay plot but there is one thing that lets this movie down and it's Martin Lawrence's character, Marcus Burnett.Unfortunately, it's becoming all too common in Hollywood for a character to be so over the top for a movie that it just becomes distracting.After surviving a near death experience at the beginning of the film, Marcus is high on life and he literally acts as if he is high for the rest of the film. This went beyond fun and playful to the point where it was distracting and annoying. It led to many frustrating scenes which felt like they belonged in a cartoon including one scene where the characters chose one of the worst possible moments to sing the Bad Boys theme.In the End, Bad Boys Ride or Die is a frustrating but okay film which could have been much better with different narrative choices although many people might enjoy the direction that the film went.\n\n                    3 out of 10 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "10",
                "Title": "Best in Series",
                "Content": "This truly was the best in series. Loved all the action sequences, great acting, great writing and great directing! This really is a movie that should be enjoyed on a big screen to experience it in full force.Furthermore, the chemistry between Will Smith and Martin Lawrence is highly entertaining and makes the movie fly by.What I also appreciated is the press tour and how Will Smith and Martin Lawrence actually seem to be really good friends which definitely adds to the experience and one can see that in the movie.Go in, have fun - in this day and age we need to stop pointing out the flaws but to go in and enjoy. This is entertainment after all!\n\n                    43 out of 84 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "6",
                "Title": "It's allright...",
                "Content": "Nothing really new (besides a few fun drone action scenes), nothing really surprising (besides a Martin Lawrence thinking he is invincible after having seen a vision), but just another well made sequel...The good: 2 guys goofing around, we know the drill, we know their chemistry and it still works. Especially Martin Lawrence's dialogues are quite funny. Fans of the earlier versions will be getting what they wished for, although dont expect fireworks, it's more of the same, but executed rather well...Any bad? The supporting actors are rather lame and not impressive at all. It's B-movie level acting. Kinda disappointing, but a minor gripe.All in all a nice sequel, even better than some of the earlier sequels...\n\n                    3 out of 10 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "10",
                "Title": "BEST MOVIE OF JUNE",
                "Content": "I honestly don't know why it's rated a 6.9/10 😭 I JUST now made this account just to let ya know this banger of a movie is 100% worth watching & a 10/10. The Comedy In the movie & Action Is GOLD!! This is 100% my new favorite movie & I'm 100% it would be who ever is reading this favorite movie too. Legit EVERYONE In the theater I was In was clapping & laughing for 90% of the movie. Easily the best movie of the month of June EVER!! & I swear I'm not overhyping the movie 😭 I promise it's as good as I say it is & I hope who ever is reading this enjoys the movie. (( PLEASE WATCH IT IF YOU WANT TO LAUGH HARD ))\n\n                    16 out of 28 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "7",
                "Title": "Good, but Inferior to the Previous Installment",
                "Content": "In Bad Boys: Ride or Die, there are things that deserve praise, like the action and comedy scenes, direction, soundtrack, performances of Smith and Lawrence, cinematography, and ending.But at the same time, there are things that are, at least from my point of view, inferior to the previous installment, like the story and the screenplay. Regarding the story, compared to Bad Boys for Life, it was of a lower level because it didn't have many surprises and twists like the previous one. And regarding the screenplay, the previous movie had a better screenplay than this one because the scenario and the order of events and how they are presented was a lot better, and cought the attention of the person who is watching more.But this does not mean that I didn't like Bad Boys: Ride or Die. I liked it, and I am looking forward to see what more the franchise will have in the future. That is why when it comes to the score, I give Bad Boys: Ride or Die 7 out of 10.\n\n                    2 out of 6 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "10",
                "Title": "Back to the Roots of the franchise",
                "Content": "Think of 2024 but with old school 90's style Michael Bay goodness. Thats right, they go back to their roots.I prefer it to the third movie because it feels like I am watching the old camera shots and humour of old,. But hey that's just my opinion. Martin and Will feel like they go to the old days only a little bit older and wiser.SPOILER We have a Reggie fight, which is amazing, in fact it is, so cool to see Reggie back and working through that father and son angst with Will\nThis film has outstanding action and double crosses. With the boys on the run from their own organisation. We have a great bad guy, intense and evil.\n\n                    11 out of 18 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "7",
                "Title": "Easy and Fun Movie to Watch",
                "Content": "As usual bad boys is a easy and fun movie to watch. Still holp up to it carracter taht we knew and the story written preaty well. Will smith and martin lawrance still played their role as their were young and jacob scipio have a great acting in this movie.The plod full off suprised and funny.I hope movie like this still continue to be made in hollywood, movie that not afraid to be offensive (because it is a joke) and keep the story with more supprise.It is a worth watch movie for casual occation. I hope you enjoy watching the movie as i enjoyes it.Happy watching and please keep reviewing movie for what is worth so we knew what we watch. Thank you.\n\n                    1 out of 2 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "1",
                "Title": "SAD Boys",
                "Content": "Hollywood can't make movies anymore. So they make pretend movies, that is movies that just runs without any goal, story, entertainment value or respect for their audience.This is one of those pretend movies.So... what do we get for our hard earned money? No much, to be honest. We get a couple of bad actors that tries to be funna (fail), that try to be cool (fail), and that try to make talk about old age and at the same time doing the things they did in the former movies (fail).The problem is that even the camera work and directing are bad. And why use shaky cameras that just make it even harder to watch this money grab? Well I guess someone is laughing all the way to the bank - unfortunately it's not the viewer. Give this one a pass.\n\n                    17 out of 32 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "7",
                "Title": "Best in fanchise",
                "Content": "My first time going to see a bad boy movie in theaters and wasn't disappointed I loved movie , will and Martin have excellent chemistry and the action is always keeping you thrilled what more can I say go see the movie you won't be disappointed I'm over the slap at this point will smith is great at his craft\nAnd would love to see it again , it's a good way of kicking off the summer just right and get you in the right mood for movie going , I believe this one of the best of movies I seen in theaters in years you won't be let down most of the bad movies was good so I already knew that it would be a good one.\n\n                    3 out of 12 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "7",
                "Title": "BAD BOYS RIDE OR DIE REVIEW",
                "Content": "This film is hilarious and has amazing action. The shots used in this movie are amazing like there's 1st person and drone shot scenes that are great. Will smith and Martin Lawrence were so funny and had perfect chemistry throughout. There was a full roster of characters it felt like fast and furious in that way. The villain lacks he's not very interesting but has some cool scenes. I like how the plot of there old captain dying and they need to find out what happened. The suspense with finding out who the rat was was cool. The pacing is great there's great action throughout. The 3rd act was epic with great action and was better than I thought it was ganna to be. Overall I loved it it's a great time in the theater, mid to high 8.\n\n                    3 out of 13 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "8",
                "Title": "Offers nothing new but still fun....",
                "Content": "Bad Boys is one of the best buddy em cop action comedy franchise and with 4th part it looks like they've run their course. I enjoyed this movie but it offers nothing new it is just same as last film which I found amazing because 3rd one came after a very long time after 2nd one, but this time magic and charm don't work.. Chemistry between Will Smith and Martin Lawrence is the real soul of these movies their comedy timing is perfect and they can still kick some ass even after 30 years.. Story was same as many other movies we've seen before good guys gets framed for something which they didn't do, they catch bad guys and defeat them. The End. There are some good action scenes in this movies mostly consists of shootouts ,I think 2nd one has the best action sequences because that was directed by Michael Bay who is known for making big scale action pieces, after some time you'll get bored seeing same action again and again but it was still very fun to see on big screen especially the FPS gun scene during climax.. Cinematography consisting of Skylines shots of Miami was cool to see, soundtrack was good and acting of man leads was the best part of movie...\nOverall I enjoyed this movie as a Summer popcorn flick, if you love action comedies with some of the old famous actors of Hollywood you should catch it on big screen. You will enjoy it..\n\n                    18 out of 33 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "7",
                "Title": "Not bad Bad Boys, not Bad at all!!",
                "Content": "So, let's be honest here, did we get a Bad Boys four so fast because of what the Fresh Prince did at the Oscars? I'm gonna assume so and I'm almost happy he did (just kidding)\nRide or Die is an excellent action film. The car chases, the gun fights the explosions it was pretty fantastic. The directors did some experimenting on some of the action sequences that did not fully get me excited but I'm not mad at the experiment.Martian Lawrence and Will Smith still have the chemistry. These two known how to bounce the jokes off each other. They got Lowery and Burnett down. One of the best on screen duos ever.As the Franchise goes, I think this movie is better because of the near back-to-back from their last outing Bad Boys for Life (back-to-back in comparison to 17-year gap between For Life and Bad Boys II). It continues the developing story between Lowery and his estranged son. Vanessa Hodges, Paola Nunez and Alexander Ludwig official join the family and then there is that interesting story arch between Burnett and his son in law that hit a peak in this movie after technically going on for three movies.Look if you like Bad Boys, you're going to like Bad Boys: Ride or Die. The only buddy cop franchise better is Lethal Weapon. Can't wait to see if Lethal Weapon 5 is half as good as Bad Boys 4.\n\n                    1 out of 4 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            }
        ],
        "Directors": [
            "Adil El Arbi",
            "Bilall Fallah"
        ],
        "Writers": [
            "Chris Bremner",
            "Will Beall",
            "George Gallo"
        ],
        "Stars": [
            "Will Smith",
            "Martin Lawrence",
            "Vanessa Hudgens"
        ],
        "Details": {
            "Release-Date": "June 7, 2024 (United States)",
            "Country-Origin": "United States",
            "Language": "English"
        },
        "BoxOfficeDetails": {
            "Budget": "$100,000,000 (estimated)",
            "Gross US & Canada": "$147,002,067",
            "Opening weekend US & Canada": {
                "Collection": "$56,527,324",
                "Date": "Jun 9, 2024"
            },
            "Gross worldwide": "$289,202,067"
        },
        "name": "3. Bad Boys: Ride or Die"
    },
    {
        "movie_name": "Inside Out",
        "movie_imdb_id": "/title/tt2096673/?ref_=sr_t_4",
        "YearDuration": [
            "2015",
            "PG",
            "1h 35m"
        ],
        "Ratings": [
            "8.1",
            "/",
            "10"
        ],
        "ReviewRelatedInfo": [
            {
                "User reviews": "1.2K"
            },
            {
                "Critic reviews": "505"
            },
            {
                "Metascore": "94"
            }
        ],
        "FilmPlot": "According to the director Pete Docter , each emotion is based on a shape: Joy is based on a star, Sadness is a teardrop, Anger is a fire brick, Fear is a raw nerve, and Disgust is broccoli. He noted that he likes broccoli very much, however.",
        "UserReviews": [
            {
                "Rating": "9",
                "Title": "I feel like everybody has missed the point",
                "Content": "I am not normally one to write reviews, but I couldn't help reading several for this film on this site that just did't seem to understand where I think the film was supposed to be coming from.The majority of the complaints I saw were that the film was 'too depressing for a children's film', but whilst I see where they are coming from in some regards, every child who I have seen watch this film (I work in a cinema) has absolutely loved it, and laughed out loud almost constantly. They are not old enough to realise the message the film is trying to convey: that life isn't all about happiness. I applaud the attempt from Pixar to make a film that is not only hilarious in places, but is also a major comment on what life is like to be a younger teenager, transitioning through one of the most important moments of life. From a more personal perspective, why should everything we show our children gloss over the reality of life, and try to make them believe everything is rosy 24/7? Again, what this film does brilliantly through the message I took away at the end was that life will never be 100% full of happiness, but that is fine. Why does it have to be? A little bit of sadness is necessary. If a person was never sad, they would be inhumane. Overall then, I suppose my review is more of a comment on the type of film we exhibit to children, and how the Nanny-state we live in looks to protect them from most of lives inevitabilities. Either way, what can't be ignored is that this film is equal parts sad, and equal parts what I am sure will become a timeless classic in years to come.\n\n                    635 out of 987 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "9",
                "Title": "I cried like a baby..",
                "Content": "I watched the movie long time ago, and I've just rewatched it today.\nFor kids it will be a funny movie with no meaning maybe!!\nBut for an adult, its so true!! You lose your childhood personality you change you feel sad, i mean it literally touches my soul\nGreat movie for both kids and adults.\n\n                    140 out of 225 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "10",
                "Title": "The fact that this movie has so many 1 star reviews is proof that there is no point in making great movies anymore......",
                "Content": "I hate to see so many 1 star reviews claiming this movie was \"too depressing\". Everyone who said that missed the point completely. Growing up ain't all sunshine and rainbows, it comes with a lot of hardships and that's what this movie is about. Riley's emotions try to help her through the difficulty of moving to a new place that isn't all its cracked up to be, and in the process Joy accidentally sends Riley into a deep depression. Sounds depressing, but what makes this movie great is how realistic her depression feels as Joy and Sadness try to help Riley out of it. I feel like this movie's message is \"Growing up will be tough, but you will get through it and there are people who will always help you through it.\" and that is a VERY important message for children.Throughout the movie there are plenty of good jokes, gorgeous animation, and a beautiful score by Michael Giacchino (idk how to spell that....) Again, just my two cents, but I think this a great movie, if very different and a bit more depressing by Pixar standards.REALLY starting to think people are just coming to trash all of Pixar's most recent movies out of jealousy or something. There's no way so many people think this movie is garbage. If the good movies are really getting this many bad reviews, it's no wonder the quality of animated movies is going down. There's just no reason to try anymore......\n\n                    63 out of 76 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "10",
                "Title": "Mandatory watch for children and parents alike.",
                "Content": "I did exactly what I was supposed to when watching this brilliant movie, I felt all the emotions at some point. Pixar did it again with Inside Out. For a long time I had stubbornly repeated that Toy Story would always be my favourite from Pixar, but I changed my mind shortly after watching this one. Like Toy Story you were offered a setup every adult can identify. Growing up learning how to control your feelings and learning the importance of every one of them. It is okay to be angry, sad, happy and afraid as long as we are taught how to manage them. The idea of having this control panel inside a human body has been done before by Osmosis Jones (2001), but let's say with much less success. Inside out takes it to the highest level of perfection. I loved the way Pixar made this world inside the main character of Riley, it is very creatively done and was in some ways just how I had imagined it. I must admit that I cried a couple of times during the movie, because it has some really touching moments. You should be feeling all emotions when watching Inside Out. It is a must watch.\n\n                    107 out of 165 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "0",
                "Title": "Not for young children",
                "Content": "I confess that I had to watch this twice before I could properly assess it. It's definitely not a young children's film, as there's precious little to entertain them, but it does have much to consider for older children and (young) adults. As a rumination on what drives us all through life, this is very effective, but I do feel that the story lacks something for making Riley so isolated in her world. Perhaps if she interacted a bit more in the story, this would be a more involving film, but the reflections on lost innocence do add some poignancy and lift this film slightly above average.\n\n                    111 out of 196 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "6",
                "Title": "An Interesting Concept with a Handful of Inconsistencies",
                "Content": "Inside Out is the hit Disney-Pixar animated movie about emotions, specifically emotions living inside a person's brain in a somewhat human form and controlling how people react to things. It's an interesting concept, and for the most part it's presented well, but there are flaws for sure. The plot is, like I already said, interesting but flawed. It bothers me that people are saying that this is an incredibly original concept despite the fact that it's been done before. It's just the most popular use of the idea, but it's not the original. The story itself, however, has a handful of really good ideas, but there are inconsistencies with it too. The disappointing part is that most of the inconsistencies are actually pointless scenes that don't add to the story but instead end up taking away from it. There aren't a lot of them, but there's enough to take away from the movie itself. Most of the inconsistencies would spoil the movie, so you'll just have to watch it to understand. Other than that the ideas are good and some are even pretty amusing. The characters are okay. I found the most interesting characters to be the parents personally, with Riley being as flat as a pancake and everyone else just not being important enough to even remember by the time the credits roll. For a movie about emotion, Riley really isn't presented in a very realistic way. Sure, at times she's good, but most of the time her character is just inconsistent. The parents were, on the other hand, much more consistent, and funnier most of the time. I think that this movie had a great beginning and a great ending, it was just the middle stuff that struggled. It's a very emotionally intense movie, especially towards the end. I felt much more into the movie at these points, and even on my third watch I got a bit emotional about the ending. The movie felt a little too short as well, but maybe that's because I've seen it so many times already. Overall Inside Out is just good. I think that I loved it so much originally (I gave it a 10/10) because of the ending. It was pretty emotional the first time, but after the second watch I started to question it. By the third watch I found inconsistencies and a handful of things that I just didn't like about the movie. Ideas and such that just weren't nearly as good as I remember. In the end I'd still certainly recommend this movie, but if you want to really love it then don't analyze it, because otherwise you'll notice the things that I did (probably).\n\n                    179 out of 417 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "10",
                "Title": "How?",
                "Content": "Wtf people. I was just reading like several one reviews and how do people get a movie so wrong?! It should be pg-13? It's not for children? Are these people out of there freaking mind? For all of you who feel that it's not for children, take a look again. You severely underestimate of how much emotion a child can handle and you would be suprised. The 1 star reviews are almost laughable about how inaccurate they are. These people should be locked up in a jail for attempting to stop bringing this movie to the world. I absolutely love Inside Out, it was one of my favorite movies of 2015, and I hope you 1 Star people live your lives full of misery.\n\n                    215 out of 401 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "7",
                "Title": "Great ride through emotions!",
                "Content": "Inside out is movie about emotions. Various emotions depicted in the movie are joy, fear, disgust, anger and sadness. The movie is about a girl who grows up to 11 years of age and then faces, what we can say, her first major mental breakdown resulting in a sad core memory formation. This happens because of the reason they move from Minnesota to a new place. The dull phase of her life is gradually overcome as the movie progresses as she learns to handle emotions more nicely.A human brain consists of various parts. It's fair to say that activity in certain part is responsible for a specific emotion. The movie has portrayed it very nicely. Human brain is very complicated structure. How it works majorly remains a mystery. The work done in the movie is a great representation of available information. The movie shows how a human being matures in terms of his emotions. Its shown how the girl learns to handle multiple emotions in terms of memory.My personal favorite emotions(characters) go in order anger, fear, joy, disgust, and sadness. Anger being the most liked one. The movie is wonderful, great job done by creators. Fairly recommended.\n\n                    36 out of 78 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "10",
                "Title": "Pixar's best film since Toy Story 3 and one of their finest overall",
                "Content": "Most of Pixar's films are wonderful (short films too), and while the three films made after Toy Story 3 weren't up to their top standards they were still better than most animation companies at their worst. Inside Out was nothing short of a masterwork, Pixar's best since Toy Story 3 and one of their best overall.Pixar films can be relied upon to have great animation, and Inside Out certainly does have great animation. No, wonderful animation and some of the company's most ingeniously inventive, with gorgeously vibrant colours, a very imaginatively rendered setting (and the lands even more ingeniously done, the next land more so than the last), very meticulous and beautifully modelled backgrounds and clever character designs that match the emotions more than ideally. Michael Giacchino's sparkling, rousing and very charming score is one of my personal favourite scores of the year so far, and every bit as great as his score for Up.A superb job was done with the script here too, the comedy is clever and witty without ever being forced and balances subtly with the drama, the drama is some of the most truly poignant of any Pixar film and it doesn't ever feel manipulative or overdone and it's very smartly insightful. The story, not one of THE most innovative concepts but is one of the more imaginative uses of it and is quite original for Pixar actually, goes at a slightly steadier pace than other Disney films, but still captivated. It was very easy to completely connect with Riley and her situation and this was easily the Pixar film since Toy Story 3 that I connected with emotionally the most, also one of Pixar's most moving stories quite easily.Loved the characters too, Anger, Fear, Disgust and Bing Bong (the imaginary friend and the 'epitome of immaturity', without ever being annoying, his back story did bring a tear to the eye) stole every scene they were in, and even Sadness managed to crack some funny one-liners even in her depressive state. Joy also positively lights up the screen and Riley was easy to connect with and much more than just a stereotypical teen girl. The voice acting is splendid. Amy Poehler is note perfect as Joy with her spirited banter giving the character so much life while also bringing a human element to her as well, Lewis Black gives an explosively barn-storming turn as Anger, Phyllis Smith is amusing and affecting, Bill Hader and Mindy Kaling are similarly priceless and in a way that makes the characters of Fear and Disgust endearing rather than annoying, Richard Kind is innocently charming and Kyle MacLachlan and Diane Lane are appropriately compassionate.Overall, a masterful return to form for Pixar. It's their best since Toy Story 3 and one of their best overall as well. 10/10 Bethany Cox\n\n                    67 out of 116 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "7",
                "Title": "Our inside feelings",
                "Content": "Given by Pixar which once again made the miracle.Nice analyse of the insight world,wonderful scenery and nice background.\n\n                    6 out of 10 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "10",
                "Title": "Beyond Words...",
                "Content": "It's been nearly a year since I first saw this film. I would say I had pretty low knowledge in films before I first saw Inside Out (not to say that I'm highly intelligent on films now). I only saw about 200 films prior. I hadn't seen a lot of classic films or even know that film can be an art form just through its camera work among other aspects. So you could say that I can't speak for everyone on my views of this film. And you may be right because opinions are subjective anyway.This is my favourite film ever.Like I said above, I didn't see a lot of films that were deemed as masterpieces at that time. While I still have a lot more to see, I can say that I have caught up with many notable ones now. I've seen The Godfather. I've seen 2001: A Space Odyssey. I've seen Casablanca. I've seen The Shawshank Redemption. I've seen Pulp Fiction. I've seen Lawrence of Arabia.Yet this is still my favourite film of all-time.80 years from now, this won't change. I felt something extraordinary that will never be felt again. This to me, was a revelation. In honest words I've never experienced something like this before. Only because of Inside Out I was able to kick myself off of a serious depression I had for years, understand the meaning of feeling, feel sympathy to why people act the way they do, be interested in films. In fact, I went and watched the films I mentioned above because of Inside Out.Ever since that late July of 2015 I had been compulsively obsessed with Inside Out to the point where I checked its Oscar chances, IMDb rating, Rotten Tomatoes rating and box office grosses to the point where I felt like I had to stop myself from doing as when seeing anything negative about it just makes feel let down and quite sad about it. It's still something that I'm trying to quit but obviously it's not going that well (ie. this review after one year of the film's release).Inside Out taught me more about depression, empathy, importance of sorrow and interpersonal relationships than any books, talk shows, real-life stories or cat posters could ever dream of. It made me want to become a filmmaker because if this much craft and intelligence can be put in a film, then sign me up to the industry because I want to be a part of it. I don't want to talk about the story or the technical aspects of Inside Out because everyone has talked about it already.In the course of less than ten months, I've see this film six times. That's more than any other film during the same period. It's a true testament to its strength and impact on me that's hardly ever going to fade away. I know this isn't the case for everybody. I keep trying to find anybody else who had the same experience as I did walking out of this film for the first time. I yielded only little results and although it brings me down a little since I don't really have anyone else to relate to, I keep telling myself, that no matter what happens to Inside Out in the future, whether its Rotten Tomatoes score or IMDb rating or its overall stature among the general public, whether it gets worse or better for it, this will always be favourite film of all-time. Nothing will change that and I have to let go of everybody else's opinion whether or not they had similar emotional experiences towards it.You can vote \"not helpful\" on this review all you want (which seems to be a recurring case for all positive user reviews here.... I wonder why...) but it's not going to matter anyway. This is a beautiful film that will resonate in me always.I will never forget Inside Out.\n\n                    111 out of 203 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "10",
                "Title": "Creative idea",
                "Content": "Very creative idea to picture our emotions as those little figures.\n\n                    9 out of 12 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "10",
                "Title": "Amazing movie- Those who bash it because it is not a kid's movie, please stop",
                "Content": "I've noticed a plethora of negative reviews all saying the same thing- their kids did not enjoy/ understand the movie and it was too dark. Yet they also say that the movie was well made and had an excellent concept. My question to these people is this- If you wanted to see a happy meaningless movie with adult toilet humour, why didn't you take your kids to see Minions? Inside out is for those who like quality cinema, to be entertained as well as taught challenging concepts. It is an artistic film. Why do you people always have to assume that all animated films have to be for kids and filled with stupid toilet humour? This is Pixar we are talking about, those who have created Wall-E and Up. Review this movie on its own merits, rather than be biased in your judgement that the film was too dark and confusing for kids. It was never marketed as a film for toddlers and little kids. I went with my brother who is in high school and it was one of the best experiences we had in the cinema in a very long time. Kudos to Pixar; it was truly an amazing, advanced conceptual, artistic film.\n\n                    260 out of 516 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "0",
                "Title": "The Older You Are the More You'll Like It",
                "Content": "Inside Out (2015) *** 1/2 (out of 4)Eleven-year-old Riley has a wonderfully fun childhood thanks to the emotions working inside of her. Joy (Amy Poehler), Sadness (Phyllis Smith), Fear (Bill Hader), Anger (Lewis Black) and Disgust (Mindy Kaling) all help keep the young girl moving forward but when her family moves from Minnesota to San Fransisco it throws everyone for a loop and soon Joy and Sadness find themselves lost in her system and trying to find their way back.INSIDE OUT is certainly another winner from Pixar who are clearly the experts of the family movie. What really amazes me about the studio is that they're actually just making adult movies that kids happen to enjoy because of the pretty characters on the screen. I say this because films like this one, UP and WALL-E really do have adult stories dealing with adult issues yet somehow the studios are able to keep kids entertained while their parents get a lot more of the jokes and the emotions that the story provides. This one here is an incredibly touching story from a parent's point of view simply because of the changes that their kids go through.There's no doubt that the animation is the star of this picture and we're really treated to some wonderful images. I especially loved the use of colors in the picture and how various colors had a certain emotion attached to it. This is certainly excellent once our adventure begins as there's a \"long term memory\" section where these wonderful color marble like things are collection. Just the site of this are a true treat for the eyes. All of the \"emotion\" characters are perfectly brought to life with both Joy and Anger really standing out. The human characters are also quite entertaining and there's no doubt that the Bing Bong character will go down as a favorite decades from now.As I said, this film is going to work a lot better for older kids and adults as I'm sure the majority of young children aren't fully going to grasp the idea of emotions and how they effect our lives. The story itself is quite charming throughout and I was surprised at how many adult issues they were able to work on throughout the running time. Fans of Pixar are certainly going to love this as it's another winner that manages to work no matter what your age is. Still, I think the older you are the more you'll enjoy it.\n\n                    39 out of 68 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "9",
                "Title": "9/10",
                "Content": "94 minutes of pure joy and emotion. A return to masterclass from pixar and not only that, probably their best work outside of Toy Story 1 and 2. This film does deserves every bit of praise it has got and more. I will say without hesitation that if you haven't seen this film, believe me you should.Lets just start easy by saying that the animation is something other-wordily. We are beyond the point where anyone needs to express the fact that pixar's animation is gorgeous, but the fact is this animation is some of the most intelligent and dense animation I have ever seen. There are easter eggs in every single frame and more than that every visual element in the movie is well rounded and clearly thought out which makes the storytelling so much more gripping. Talking about storytelling, rarely does a film do visual storytelling so brilliantly. Five minutes into the movie I was in and I knew how things were rolling. This s really a lesson on how to think things out visually and how to use visuals to your advantage as much as it is possible, combining them to smart, engaging ideas.And now to the layers the film has. The deepness of its themes, the intelligence of its story, the subtext behind every action and word, the comedic touches, the insanely funny pop culture references, the poetic approach to joy and sadness, the emotional depth, everything, I'm telling you everything here is gut wrenching. There isn't one scene where you feel time is being wasted, there isn't one word a character speaks that doesn't feel genuine, there isn't one idea that is boring or unoriginal. This film is beyond emotionally engaging, this film gives you a mirror on which to reflect your life and think about it, but no wait it doesn't stop there, it also gives you the opportunity to laugh about it, that no matter what is going on there is also space for a laugh and for lightness. Wow.After a second viewing I have settled on the problem I originally had and can now honestly say this film really just has nitpick issues, it's truly a great one and definitely the best we've been given in 2015 so far. After my first viewing I was all enthusiastic about everything above, but I also was left a little confused by the mythology the film uses and wasn't quite sure it always fit. Upon a second viewing I guarantee that there is no such problem. The mythology is perfect and works with a solid and thought out logic that takes into account the chaos of life. What doesn't quite work is the fact that the film does have a few really minor shortcuts or conveniences that may stick out and I honestly wanted a little bit more of the control center room scenes and see some more of how it worked there, but then again I am really nitpicking.Incredible for me to say it, but I really want a sequel to this film, it's incredible. I want to see another two hours of the five emotions battling in out in the life of Riley and her further struggles, especially want to see the teenage years. This idea is truly amazing and special and it is so inspiring to me, I just really want a sequel to this film and that's the first time I've ever said that in my life.Trust me this film deserves every single bit of your attention and heart, it will take you on a roller-coaster of emotions and entertainment that is absolutely delightful and will also leave you thinking for days.\n\n                    88 out of 167 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "7",
                "Title": "Didn't live up to my expectations",
                "Content": "I had high expectations for this movie, and I was quite disappointed when I finished it. I really hope Pixar does better next time, because this is not good enough.The people who gave it an 8, 9 or 10 out of 10 need to calm down though, and so do the people who gave it a 1, 2 or 3. It's definitely not amazing, but it's definitely not \"the worst\" either. Those who say it's one of the two are exaggerating. Personally, I think it's mediocre. It has some fun, interesting elements to it, and the concept is original. It starts out quite interesting, the beginning is the best part, but the rest is not as good. It relies heavily on clichés, and none of the characters feel original. None of them develop much either, not even the main character, they're predictable and quite boring. Actually, you don't really get to know them, not even Riley, which is pretty ridiculous considering the movie is set inside her head. The parts that are supposed to make you laugh only make you smile awkwardly, because they're so cliché. There is no \"wow factor\", and the ending was predictable. Definitely not what I would expect from Pixar.I wouldn't recommend or discourage people from watching it though, as some may enjoy it, but people probably shouldn't get their hopes up.\n\n                    26 out of 64 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "10",
                "Title": "Tears of Joy",
                "Content": "Before I start, I will say this; I'm writing this after coming back from a second viewing of Inside Out. Both viewings were out of choice. That's not a unique thing, but I very rarely watch films more than once at the cinema, mainly because life is short, or rather, life is too quick for me. But there's two main reasons why people watch some films more than once at the cinema, especially where I come from; either the film was interesting, detailed, or multi-layered and needs to be seen again to sink in properly, or, it was really, really good.In this case, for me, it's the latter. That's not to say that the film isn't interesting, detailed or multi-layered, but the reason that was repeating in my head to see it again was 'it's really, really good.' But is it? Yes, yes of course it is... Speaking with a bunch of friends with whom I saw it the first time, a risky phrase was unanimously agreed upon, which was that we 'trust the Pixar team to do the right thing.' Needless (totally needless) to say that expectations were high, and frankly, they were surpassed.Even though the film is what we come to expect from Pixar (the universal moral themes, the perfect balance between comedy and sadness, and visually stunning animation and action sequences), I didn't feel that I had seen it all before, and neither was it repetitive nor 'ordinary'. The film hits all the high notes, with perfect intonation, and with discipline and passion. As touched on before, the balance between humour and sadness is strong and impressive; the amount of emotions that the film displays and takes us through is varied and immersive, yet not overwhelming. The film executes such clever ideas with simplicity and ease, leaving us to feel for the characters rather than worry about the 'science' of it all, or even being worried about 'not getting it'.The animation is constantly eye-drawing and detailed; the characters' glistening skin is particularly wondrous. And what great characters they are. Riley is brilliantly sympathetic throughout, even with her difficult mood swings, and the supporting characters are perfectly entertaining. One might think that the superficial nature of the characters (Anger is angry, Fear is always scared etc.) would become old quickly, however the fun never diminishes, thanks to a witty script, expressive animation, and very strong voice performances from the entire cast.However, to top all this off, the real gem comes from the character of Joy, surely a strong contender in the list of Pixar's greatest characters. Even though we are inside the head of Riley for the majority of the film, and the events that drive the movie are essentially her reactions to her new world (moving from Minnesota to San Francisco), the story is Joy's. Being probably the most flawed character in the film (paradoxically, maybe), it's her journey we care about the most, and she ends up being the most in-depth character in the film, occasionally questioning her actions in the first half (well, the cynics will be), and becoming the most sympathetic by the end. Amy Poehler's outstanding performance makes Joy simultaneously the strongest and weakest character in the film (emotionally, that is).After all of this, the freshness of the ideas, the simplified neuroscience, the technical brilliance (saying that, Giacchino's score is probably the most subtle thing in the film, exquisitely putting the finishing touches on the most emotional scenes), fleshed out characters and universal themes, all of this comes together simply to entertain us, to let us escape, and to release us emotionally, which it does by making us laugh and cry in an even and fair manner.And you will laugh. And you will cry. And it is fun to do so. Thank god we're living in a time when Pixar is making these films.\n\n                    379 out of 781 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "10",
                "Title": "Best Pixar Since Toy Story",
                "Content": "After some ho-hum years and too many sequels, Pixar is back and better than ever with Inside Out, a boldly unique animated film that renews our faith in what a giant studio can do with an original concept. Docter combines the strengths of his two Pixar masterworks here: the endless inventiveness of Monster's Inc. and the poignant strength of Up. A truly fantastic mixture of fantasy-adventure-comedy and small-family-drama, it's a genius work of conception, execution and emotion that will go down in the annals of Disney animation as an instant and enduring classic. It follows Joy, the leading-emotion of an 11-year-old girl, as she tries to navigate a big change in her young life. Much like Toy Story 3, we're shown the inherent difficulties of growing up through a fresh viewpoint, learning what makes you \"you\". It's a convoluted idea that's nearly impossible to explain, and yet Pixar nails it, perfectly shifting between its parallel universes with ease. The humor throughout will undoubtedly have kids and adults in equal stitches, with fantastic turns from everyone, notably Poehler, Smith, Black, and Kind. However, this film's high-point may be the multiple emotional gut-punches that will reduce parents to tears. That fearlessness to be gloomy is basically the thesis of the film: true joy comes when every emotion is allowed to be recognized and dealt with healthfully. It's quite a psychologically complex stance to take for a film that manages to be so kid-friendly. This wonderful balancing act helps make Inside Out worthy of the \"M\" word (masterpiece) and gives it the distinction of being Pixar's best since the unparalleled Toy Story.\n\n                    192 out of 386 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "1",
                "Title": "movie misses the most important point entirely!",
                "Content": "All that money spent to make it and the movie misses the most important point entirely! The most important human emotion is LOVE, not the other ones that play key roles in the movie. And it is LOVE, Mr. Pete Docter, not LAVA, but I guess it is pointless to explain what LOVE is to someone who does not put much value on it.I did not know that children are supposed to scream at parents or throw temper tantrum, or do other crazy things the girl in the movie did when she did not like what her parents did. But according to Pete Docter it is perfectly OK and only natural for a 10 year old to do. Slamming doors in parent's face is OK. Giving them silent treatment is OK, too, according to the directors. But what is really bad, according to the movie, is a healthy veggie pizza! What is really Inside Out is the director's understanding of values and what is good and what is bad.Trust me - your child will get a lot of wrong ideas after watching this piece of junk. Save your money, go watch something else!\n\n                    312 out of 655 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "9",
                "Title": "An artistic triumph",
                "Content": "For some reason, I couldn't quite catch this movie in theaters and I managed to watch it on an international flight. And boy, am I glad I did! As far as concepts go, I was astonished at the amount of detail and coherence in execution. The visuals are absolutely stunning, the colors rich and vibrant, the characters utterly memorable and some of the most poignantly heart-breaking lines of dialogue ever spoken/sung in any movie, let alone feature animation. It is every bit a Disney-Pixar classic and as emphatic a return to form as it can get.The story revolves around a young girl child who is happy in her world and has to suddenly acclimatize to another environment when her family has to move. Growing pains and social issues affect her while she grapples with increasingly complex situations, both at home and school. Meanwhile, the interplay between the five primary emotions inside her mind is both dynamic and fraught with compromises, much like how we deal with others everyday. As things come to a head and young Riley is about to make a life-changing decision, the events that follow leave a lasting impression, with an increased appreciation of the phrase \"emotions are what makes us human\"! I recognized some dichotomies - for instance, Minnesota, usually perceived cold, is regarded as warm and comforting by Riley while San Francisco, renowned for its sunny weather, is seen as foreign and unwelcome. The other contrast I noticed was all five emotional figures (Joy, Sadness, Anger, Fear, and Disgust) do not always stay true to form, with Joy especially exhibiting nuances far beyond what her name implies - case in point, her touching admission preceding the last act (that entire sequence was too much for my eyes to take, by the way). All this might be considered a tad too much for young children to appreciate, but with time, they may probably realize how beautifully honest this movie was in trying to portray their growth and the underlying issues.Certainly, it is not without flaws: the plot meandered a bit 2/3rds into the length; Joy's \"A-ha\" moment seems strangely contrived, despite the impact it had; the music was adequate but not truly captivating as in the case of other Pixar offerings. But the beauty of this medium is that it offers filmmakers opportunities to steer audiences to more engaging experiences; Pete Docter and Co accomplish this with aplomb.In terms of cast and crew, the voice actors are superb selections - Lewis Black aces the Angry persona with generous dollops of sarcasm; Mindy Kaling is just perfect voicing Disgust; Richard Kind's performance as the imaginary Bing Bong is an absolute tear-jerker, while Kaitlyn Dias shows remarkable poise playing Riley. But it is Amy Poehler who steals the show in a coruscating blend of vivacity, vibrancy, and vicariousness. Her Joy is not an infallible leader, but one who accepts others in the face of challenging situations and plows ahead with inspiring positive energy. The animation left me spell-bound, especially the sequence where thoughts are shown to be abstracted, and are endowed with a lot of heart. The movie is fairly short, but a running time of 94 minutes is appropriate justice to a slightly heavy subject matter. The humor compensates with trademark Pixar staple of jokes, albeit intended for slightly more mature viewers. Pete Docter gave us the outstanding Up six years ago and ably accompanied by Ronnie del Carmen, has categorically demonstrated that he is a fabulous storyteller and a master entertainer.Inside Out is every bit a Pixar fan's well-deserved reward for patience. Do yourself a favor and watch this magnificent gem.\n\n                    203 out of 416 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "9",
                "Title": "Absolutely Brilliant!",
                "Content": "For every child, growing up can be exciting, confusing, and difficult. For Riley, who is uprooted from her Midwest life when her father starts a new job in San Francisco, Riley is directed by her emotions, Joy (Amy Poehler), Fear (Bill Hader), Anger (Lewis Black), Disgust (Mindy Kaling) and Sadness (Phyllis Smith) in Headquarters Control Center inside Riley's mind to help her overcome everyday life. However, Riley and her emotions struggle to adjust to Riley's new life in San Francisco and emotional disorder arises. Although Joy, Riley's main and most fundamental emotion, tries to keep things optimistic, the emotions fight on how best to navigate Riley's new world.After watching \"Inside Out\" with my wife, we both agreed that \"Inside Out\" is the perfect Pixar Animation movie for any family on a night out. It was both imaginative and relatable for both children and adults. I never thought \"Inside Out\" would be this enjoyable, but I was able to experience every emotion of \"Joy\", \"Disgust\", \"Anger\", \"Fear\", and \"Sadness\" for each and every moment of this film. At the end of the night, I was pleasantly unsatisfied because I wanted to watch the movie again and again. Parents, if you're looking for a fun filled movie night with your children, this movie will not only please them, but you as well.A Definite 9!! Well done Pixar!\n\n                    202 out of 419 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "0",
                "Title": "This is the Pixar I Know and Love",
                "Content": "Please excuse any mistakes as my English is not very good. There are no spoilers in this review.I had the pleasure of seeing 'Inside Out' at the Cannes Film Festival and I must say it was wonderful and a huge step-up from Pixar's recent efforts. The trailers don't really do it justice. The story may seem complicated for younger viewers, but the way Pixar tells the story fits for both adults and children. The pacing is in the vein of Wall-E, and in that sense it is very much a film for adults as it is for kids (like most Pixar movies). The story here is surprisingly raw and emotional, one that has very deep underlying themes that adults will connect with. Many of the audience members were crying at the end. It has one of the most original stories for an animation in the last few years, and I believe many people (especially adults) will form a connection to it.Speaking of animation, the film is breathtakingly beautiful. There is a nice contrast of colors that make it look vibrant, like Pixar's 'UP'. The voice cast did a wonderful job and you couldn't ask for better direction from Pete Doctor and co. I cannot wait to see this a second time with family and friends. Highly recommended.PS: The short that played before the film, 'Lava', was also beautiful. It was sort of a musical, and it was quite funny and clever. The audience even applauded at the end of it, myself included. In that sense, it provides the entire package a nice balance of joy and laughter (Lava) followed by deep storytelling and emotion (Inside Out).\n\n                    142 out of 296 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "10",
                "Title": "GENIUS!!!",
                "Content": "A movie about emotional intelligence...After watching this movie, I can sense which feeling is controlling me... I kind of like it😆😆\n\n                    10 out of 15 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "6",
                "Title": "Emotional mess not masterpiece.",
                "Content": "It is good animation, and it has its moments, but it is just too unhealthy, unrealistic, and nonsensical in how the emotions interact, and in how they put together Riley's arc. The loss of memories just did not quite make sense. She may not view them the same, but she does not have Alzheimer's, so the crisis, and the tragic part of the movie lost a lot of their sting for me due to their relatively weak reasons for happening. So while it was not bad, its story construction was weak, and it was not for me. I know a lot of people who use the excuse it is animation to excuse these types of shortcomings, and they generally enjoyed this movie more than me, so it may still be worth the watch.\n\n                    1 out of 1 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "10",
                "Title": "Why",
                "Content": "I would say don't believe the bad reviews on here. People apparently don't find movies that teaches children something, a good thing.\n\n                    13 out of 22 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            }
        ],
        "Directors": [
            "Pete Docter",
            "Ronnie Del Carmen"
        ],
        "Writers": [
            "Pete Docter",
            "Ronnie Del Carmen",
            "Meg LeFauve"
        ],
        "Stars": [
            "Amy Poehler",
            "Bill Hader",
            "Lewis Black"
        ],
        "Details": {
            "Release-Date": "June 19, 2015 (United States)",
            "Country-Origin": "United States",
            "Language": "LanguagesEnglishPortugueseLatvian"
        },
        "BoxOfficeDetails": {
            "Budget": "$175,000,000 (estimated)",
            "Gross US & Canada": "$356,921,711",
            "Opening weekend US & Canada": {
                "Collection": "$90,440,272",
                "Date": "Jun 21, 2015"
            },
            "Gross worldwide": "$858,852,998"
        },
        "name": "4. Inside Out"
    },
    {
        "movie_name": "IF",
        "movie_imdb_id": "/title/tt11152168/?ref_=sr_t_5",
        "YearDuration": [
            "2024",
            "PG",
            "1h 44m"
        ],
        "Ratings": [
            "6.6",
            "/",
            "10"
        ],
        "ReviewRelatedInfo": [
            {
                "User reviews": "239"
            },
            {
                "Critic reviews": "136"
            },
            {
                "Metascore": "46"
            }
        ],
        "FilmPlot": "We've pulled together all the big (and small) summer movies to keep on your radar, including Kevin Costner's two-part western, Eli Roth's video game adaptation, and a remake of the '90s goth classic, The Crow .",
        "UserReviews": [
            {
                "Rating": "7",
                "Title": "Why did you have to do that?",
                "Content": "My youngest daughter wanted to see this, it has Ryan Reynolds in it, so I thought \"what the heck\". Man I did not anticipate that I would be a bumbling crying mess at the end of this film.I wouldn't say this is a kids film, it's more of a film for adults who still have that child still inside of them, but they lost their way when they grew up and became adults. This is a movie for the child inside all of us, that still has that glimmer of hope.John Krasinski seems like a big child, and that's basically what he was playing in here. I don't mean that in a negative way, I find it very endearing because you don't see that a lot anymore in people.I really liked seeing the imagination of the little girl in here, but as I stated this is a HEAVY movie, so some things kids may not enjoy in here. When we got out of the movie I asked my daughter \"did you like the movie?\" and she said \"yeah, it was funny and sad\". I would have to agree with her assessment.I would say that if you have a child that has trouble concentrating or sitting still, then they will be miserable in this. This is definitely targeted more for adults.\n\n                    116 out of 132 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "8",
                "Title": "Evoked something in me",
                "Content": "Went to see an early screening of IF with my wife and son last night. The cinema was practically empty with only a few other families there? The film despite being 2024 was not the modern fast constant attention providing obvious story that films have now often now become for children . IF slowly develops , it draws you into its world and developing your care or wonder about it's characters. That adults too became invested in this is a film for multi generation and works on more levels than expected.Overall It hit and pleasently entertained the younger children but then something magical happened as the film developed towards it end. Without spoiling it I saw around me the adults rubbing tears from cheeks. Grandparents suddenly holding tighly hands closer and i got it . Well it got me ! This film started to evoke strong emotions about a child's film I had not felt since those Coco or the ending of AI or toy story 3 days. This film touches you.The screenplay and cinematography are excellent I need to see it again but the layers of this film make it a U universal (suitable for all)\n\n                    69 out of 91 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "6",
                "Title": "Beautiful movie but...",
                "Content": "This was a visually stunning and whimsical movie. It had a star studded cast with Ryan Reynolds, John Krazinski and Steve Carell. In fact it could have done without a star playing the dad I thought, as this detracted from the emotional opening scene. The movie felt boring at times for the first two-thirds, despite the interesting concept of the story; I think it lacked suspenseful direction in the plot development. Ryan Reynolds had about three great funny moments, all of which are in the trailer, and it's a shame he wasn't able to bring a bit more of this well known personality into the film throughout. The last third was definitely the highlight of the movie and did get more exciting and definitely heightened the emotion of the movie.\n\n                    69 out of 97 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "0",
                "Title": "30 year old male perspective",
                "Content": "I must admit, the first half hour had me questioning if I was wasting my time. I was confused about the vast demographics the film was trying to appeal to. Maybe there could've been some improvements there.Once the 2nd act started, I slowly started to find myself more and more invested in the characters. However, I was still questioning potential plot holes in the story and the films demographic.During the 3rd act, it really tied itself together and started to make a lot more sense. I want to rewatch it knowing how well it ends, similar to a Christopher Nolan film. I'm curious what a child would think of this film because it deals with some adult themes and subject matter that only an adult would relate to. It isn't crude, it's very family friendly. A child might find it slow and boring at times. The moral of the film might go over a child's head but there's plenty of humour and subject matter aimed at children.Overall, I was very impressed with this film, and I'll be watching it again. Take your kids to it. If they don't enjoy it now, it'll definitely have a completely different meaning to them in 10, 20, or 30 years. As an adult, you'll almost definitely enjoy it.\n\n                    112 out of 136 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "6",
                "Title": "Harmless family movie",
                "Content": "Harmless and wholesome family fun. Pretty simple and heartfelt story for the kids. It has some great cast members mostly with the voiceovers but they are in it, not as much as I'd hoped but they are there. It's a very imaginative film with a few cool fantastical scenes, particularly the dance number in the imaginary place. Reynolds didn't really shine as much for his personality and wasn't as funny in this but still a good presence. Cailey (the girl) being from the walking dead too seems to be doing well for herself being put in a Krasinski and Reynolds movie. Sometimes the film lacks and the story gets weak in the middle but overall you can understand it. The ending is probably the best part as it has the most weight to it and emotion about what imaginary friends are and what they do and mean for us. Also a nice little surprise of an ending if you didn't see it coming. Overall just a good family film but could've been a bit better.\n\n                    25 out of 37 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "6",
                "Title": "Could have been Better !!!",
                "Content": "Imaginary Friend is a movie likely to appeal to kids and some adults as well. I admit the movie has an interesting concept which could have been made a bit more interesting and happening than it turned out to be.John Krasinski teamed up with his old pal Ryan to make this family friendly movie after A Quiet Place but the movie takes quite some time to take off and mashes up what could have been a more fun and action filled fantasy adventure rather than just an emotional rollercoaster.Some of the IFs imaginary friends, although colorful and happy, could have been used a tad more and could have made this movie more adventurous and funnier than it turned out to be.\n\n                    27 out of 47 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "7",
                "Title": "A warm film with Krasinki's heart shining through",
                "Content": "IF had all the hallmarks of being a great family film and in the main it did not disappoint. There is humour, crazy characters and a unique and understandable plot. However, I did spend a lot of the film thinking it could have been better but not being able to put my finger on why. There are clearly moments when the jokes don't land like you might hope and some of the IF's are not given much screen time making the whole thing seem rushed. Despite this Reynolds is as watchable as ever and Cailey Fleming steals the show as Bea, a 12 year old girl just trying to find her way in life after the death of her mother. But at the core of the film is the heart of Krasinski and it seems that he is able to find that in whatever genre he turns to. There are moments that are genuinely moving in IF and if you're not wiping away a tear or two then maybe it is not one for you. All in all, a fun, family ride that, despite its faults creates a feeling of warmth and joy.\n\n                    3 out of 3 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "10",
                "Title": "Pure magic!",
                "Content": "I'm offering a huge standing ovation to John Krasinski and the entire cast of IF! This movie is magical, heartfelt, beautiful, and the kind of film that will stick with you forever. The casting is perfect.I am a 48 year old mother of two, and all three of us left the theater with a sense of awe and wonder. I am also a mental health therapist, and I can clearly see how this movie can Serve as a highly effective tool for use in groups, as well as individual therapy. This is the type of material that illicit emotional responses that can set the stage for highly effective individual and group process. It is one that I will be incorporating in my own professional practice, and I encourage other therapists to do the sameFor the teachers, this film would be a wonderful addition to social emotional learning programs. The message of the magic of childhood, resiliency, and community is undeniably effective.I cannot wait for this movie to be released for purchase because I will be buying it on day one and re-watching this over and over again. I will confidently go so far as to say that this movie is the Mary Poppins of the day.\n\n                    107 out of 146 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "6",
                "Title": "Not as funny as I had expected",
                "Content": "Really hoped that this would become known as a family classic. I took two thirteen year old boys and both thought it was average at best. Effects are good but there was a serious lack of jokes. A film that will not live long in the memory. Cast is great, film also looks great but there was no sense of excitement at any point. Quite flat throughout the whole film. Felt like the film is aimed at children under ten but I think that age group will also struggle as it just has no magic. Needed alot more jokes, less schmaltz and some excitement. Waste of a very good cast. I really did want to love this film.\n\n                    27 out of 49 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "9",
                "Title": "This is why I used to love going to te movies :)",
                "Content": "I am 70 years old and my wife is right there with me. My childhood was filled with movies that entertained, made you sad, made you happy, and sometimes really made you think. Seems like lately, movies have dropped the \"entertaining\" part in order to lecture you on a variety of social issues. It's still possible to find movies that do what movies were supposed to do but they are rarely from the major studios (Unsung Hero, Arthur the King, The Shift).However, what a delight THIS movie is.... It makes you run the gamut of emotions from sadness to anticipation to thinking you know what's going to happen to having your heart warmed :)We absolutely loved this movie and will probably see it again before it leaves the theater.On a side note, I continue to be amazed by these young actors who can display such a wide range of emotions. Much like Alisha Weir in Abigail, Cailey Fleming absolutely nailed the role.If you want a family friendly movie to take your kids to, this one is it!\n\n                    24 out of 31 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "7",
                "Title": "Wholesome kids film for adults",
                "Content": "IF is narratively chaotic in a way that hinders the pacing but it's also extremely wholesome and refreshingly original (in the literal sense). It has grand ambitions by merging a Spielberg homage about never truly growing up with an attempt to be a live action Pixar movie so even if John Krasinski falls short of these noble goals, he still ends up in a pretty good place.With Ryan Reynolds doing a nice family version of his usual cynical quip machine and a bunch of A-list stars in small voice roles who are fun to recognise if nothing else, it's up to Cailey Fleming to bring all the emotions and really sell the sense of wonder which she achieves with ease. Also, John Krasinski casting himself as the dad avoids vanity thanks to how endearing he is.Crafting a world of imagination isn't easy to do and John Krasinski's direction manages to come up with enough inventive moments to avoid feeling creatively inert. Michael Giacchino's score threatens to be overbearing without completely going there. There's barely a moment where it isn't present and it's got the sense of childlike wonder and adorably twee nature to pull it off.\n\n                    11 out of 18 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "5",
                "Title": "Wanted to like this movie",
                "Content": "I was expecting more. Great cast and promotion but the movie falls flat. It's very very slow in the beginning. The end was cute and heartwarming. Not much in the middle. Should have moved faster and been a little more funny. Depending on the day you could fall asleep in this movie.Great idea but not put together well. I do not think children would like this movie. Maybe older kids. It barely kept my attention as an adult. Now that I reflect on this movie I'm not sure who the target market is. It's just an ok movie. Will maybe watch one more time with my kids at home when it hits streaming but I wouldn't waste money seeing it in theaters.\n\n                    34 out of 59 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "7",
                "Title": "Meandering Down Memory Lane",
                "Content": "I will start off by saying that I really enjoyed the movie as a whole. It has some genuinely beautiful scenes, at times genuinely jaw dropping visual effects, and a stellar performance from its lead. The messages delivered here (although at times a bit sparse) are lovely, with the father's relentlessly positive outlook being a nice backdrop of support even if it isn't highlighted often enough. I absolutely loved the character designs, and there is a scene where many of them are introduced all at once that I thought excellently captured the whimsy and rapidly malleable nature of a child's imagination.That all said, the film needed a much stronger hand in either the script writing, overall direction, or both. It meanders almost aimlessly at times, and several times whiplashes back and forth from imaginative frolicking to tear jerking sadness at such a breakneck pace that it honestly felt as if several transition scenes had been cut from the film after shooting. It frequently felt disjointed, and I wish they would have spent more time on the side characters to more fully flesh out the story.I can't help but compare the movie to other films, in particular Bridge to Terabithia and A Monster Calls, both of which tackle similar issues while proving more substantive and fully fleshed out. Be warned though, the movie does an excellent job of pulling at your heart strings in the same way these aforementioned films do, and you will find yourself crying several times if you're anything like me. I definitely recommend seeing it, even if it doesn't quiet live up to its potential.\n\n                    4 out of 5 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "7",
                "Title": "A story you have to believe to see",
                "Content": "I like John Krasinski both as an actor and as a director, so having him direct and write a family film about imaginary friends with a lot of well-known actors got my interest, and when it comes to this film, I was expecting this film to be enjoyable or at least nice to watch; after watching it, I can say that this is an enjoyable and imaginative family film that was nicely handled. The film called IF (2024) was nice to watch with its great performances, funny moments, nice looking 3D CG animation, nice looking cinematography, heartfelt moments, and creative but simple imaginary friend designs; I liked the premise to the film with it sounding like Foster's Home for Imaginary Friends (2004-2009) the animated show on Cartoon Network, and I thought director John Krasinski did a great job with putting that premise in a live-action setting with the great 3D CG animation that makes the imaginary friends look like they are there in a scene interacting off of the main two leads.The performances from the leads Bea and Cal, played by Cailey Fleming and Ryan Reynolds, were both well-done with Bea trying to grow up too fast and being able to see a lot of imaginary friends and Cal trying to help these imaginary friends with finding a kid to be friends with; Bea was believable enough as this kid dealing with the loss of her mother and her dad, played by John Krasinski, being in the hospital while learning about imaginary friends and lending a hand in finding new owners. Cal seems like a grumpy character of sorts who knows a lot about how the imaginary friends work and where they live, and he can be funny at times, along with him being a likable enough character like Bea; Bea and Cal worked well together when trying to find owners for the imaginary friends, and they build a nice friendship with each other. Lastly, all the imaginary friends were entertaining with them all having well-known actors voicing them, like Matt Damon, Emily Blunt, Bradley Cooper, Etc, along with Steve Carell as a main one named Blue who is a likable character trying to find his owner; each imaginary friend had a simple but creative design, and they looked good in the live-action setting with its nice-looking 3D CG animation.The 3D CG animation for the imaginary friends was particularly good with it having nice details and made them look good in live-action locations, with them also looking believable when interacting with the two lead characters; I like that there is no villain/antagonist in this film, because it does not need to have one, it is just an entertaining and funny film that also has effective emotional moments. At times, the film would feel like it was going all over the place, but it was not confusing, and I felt like there could have been more done with a premise like this, but they still did a respectable job with it; the film is imaginative with how the imaginary friends look, how Bea's imagination works, and how imaginary friends find friends or their old owners, along with their being quite a bit of creative things involving Bea using he imagination to change look of a certain thing.The film called IF (2024) was nice to watch with its great performances, funny moments, nice looking 3D CG animation, nice looking cinematography, heartfelt moments, and creative but simple imaginary friend designs; I liked the premise to the film, and I thought director John Krasinski did a great job with putting that premise in a live-action setting with the great 3D CG animation, along with some minor issues with the film. This is just an enjoyable an entertaining family film that plenty of people will like, because this film took an interesting premise and did something fun with it, so I will recommend giving this a watch, especially if you like John Krasinski as a director; sometimes all you want is a nice heartfelt film to watch, and this is one of those.\n\n                    4 out of 5 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "6",
                "Title": "Emotional rollercoaster, bring the tissues",
                "Content": "This film was advertised as a very creative kids animated movie, and it is that in parts, but very slow and lots of drama, perhaps more for Parents? Parents, bring tissues, you will cry. Folks who arent parents might not get much out of this. Problem I have with this film; What grandparent would let a 12 year old go to Coney Island every day solo from Manhatten, without communicating until dinner time?!? There is not one phone in this film, Not in this day and age. Some parts of this film are very trippy, well animated, and when its in that zone it is super fun, but it gets back to drama, and there are parents both dying and sick, and it is a tearjerker at 3 points in the film, including the opening credits. Young kids will be bored, preteens will be entertained enough. I asked my 11 year old if he ever had an imaginary friend and he said no, I said me neither. He said it wasnt bad but he was expecting more animation. This could have been better with less hospital and more roger rabbit style scenes. They made a high budget well made drama with excellent cgi animation. It has lots of Heart, 6/10.\n\n                    15 out of 27 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "6",
                "Title": "A great story in a mediocre film",
                "Content": "John Krasinski is a filmmaker I will continue to follow, no matter what project he is working on. A Quiet Place and A Quiet Place: Part 2 were both fantastic horror/thrillers and coming from TV comedies and low-budget indie films, Krasinksi has proven he is more than just the quirky actor we all love. IF is his latest directorial effort and while I'm a fan of family movies and creative ideas, I don't believe this concept was brought to its fullest potential. Sometimes a nice idea just isn't enough, and IF is a perfect showcase of that. With a lot of solid ideas and plot devices going for it, let's dive into what I thought went wrong.After the loss of her mother, Bea (Cailey Fleming) is going through a difficult time in her life. Her father (John Krasinski) is also in the process of having surgery, so the weight on her shoulders when the film begins is quite heavy. Beginning to see a bunch of random, unique-looking creatures and ideas come to life around her, she begins to realize she is seeing the imaginary friends that everyone has grown up with and forgotten. In comes Cal (Ryan Reynolds), who can also see these \"IFs,\" as they embark on a journey together in order to reconnect these \"IFs\" with their people who have grown up. This concept is beautiful and almost even brought a tear to my eye, but I feel as though there are far too many similarities to other films, without it really doing too much to stand out on its own.I will say that the payoff/twist at the end is effective, but maybe it's just that I've seen too many movies like this. I was able to predict the main twist pretty early on in the movie and since that was what it all built up to, I felt a little underwhelmed. Still, for those who don't see a few things coming, I'm sure you will feel the emotion more than me. It's a well-constructed movie overall and Krasinski still continues to prove he has a knack for directing, it's just that the magic he thought he was heavily injecting into the film felt a little flat to me. I will also say that there are many times when some viewers may find it overly sappy, but I found those moments to be a nice cherry on top of an otherwise good, but predictable movie.In the end, this is something kids may enjoy, but I feel it's also aiming for adults with mature storylines. However, these two things clashed for me on multiple occasions because I wasn't sure if it was trying to be cute or thought-provoking. Maybe the answer to that is both, but it didn't work for me. The overall story is more than worth the time, so I'll give it a mild recommendation, but maybe temper your expectations, especially if you've been looking forward to this one. IF is a great story in a mediocre execution of a movie. It's now playing in theatres, but you can wait for this one.\n\n                    10 out of 17 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "9",
                "Title": "The Ending saves this from being an interesting thought experiment",
                "Content": "The majority of this film I was questioning this film, I won't lie. The messaging seemed all over the place, the target demographic similarly seemed to vary scene to scene. There were a bunch of grin inducing moments and some good laughs, but I was frustrated by the film's lack of commitment to answers or internal logic, why certain things are important etc. I was very impressed with some of the acting, John Krasinski and Fiona Shaw are delightful in particular and the stacked cast is a wonder of \"I know that voice\" all of which are charming. But it seemed the key function of pairing imaginary friends with kids to be a very child friendly line. The way it takes it in reality is far more adult while still being a little confusing. I got about 70 minutes into this film and started wondering why, if anything other than a 1 sentence summary John Krasinski and Ryan Reynolds had said this was a live action Pixar film.The ending and the subsequent hours of reinterpretation and pondering leave me in awe of its execution. I still think there are problems, and scenes that feel very haphazard in some ways, and I still feel some bewilderment over a film that takes 90% of its run time to come into its own. It's a fantastic twist, and similar to Gone Girl (an odd but apt and well considered comparison given that to mention any others would constitute a spoiler) is one of the best examples of a twist impacting your entire viewing experience, I've ever seen. Everything crystallises and the amount you get from it as a young adult increases exponentially-I can only wait and look forward to how its meaning and poignancy will change throughout the rest of my life as the best Pixar films do.\n\n                    52 out of 76 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "7",
                "Title": "Warm & thoughtful",
                "Content": "Having read the preview in my movie magazine, the general plot reminded me of early 1990s movie classic 'Drop Dead Fred' with Rik Mayall.But this time round, a colourful mix of childrens imaginary friends of all shapes sizes and textures seeking to reconnect for a childs affection.Boosted by the voices to name a couple... Brad Pitt & Steve Carell.Our eccentric leading man 'Ryan Reynolds' who leads these charming loveable characters reconnecting to their loyal companions of yester year, think Toy Story with Andy and his toys, but this time its the imaginary friends searching for someone to love them.Director and star 'John Krasinski' playing a loving father supported by his young daughter, a movie that deals with Bereavement, how we cope and move forward, its harrowing and thoughr provoking, a light hearted movie that I think that when we watch it, we all had someone their to give us a squidge when needed.\n\n                    5 out of 7 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "5",
                "Title": "What IF... Jim from the Office made a live action Foster's Home for Imaginary Friends",
                "Content": "Pros:\nA stellar cast with some good performances by both adults and children. Along with a legendary voice cast that will have you checking the credits at the end of the movie.Some good moments of fun that are mixed in with some heartfelt moments that will bring back your childhood.Cons:\nThe plot is very over complicated (especially for a family movie) that will have both parents and kids scratching their heads at times.Besides a few scenes, the film lacks a lot of imagination and creativity which contradicts the film's message.The special effects used on the IFs comes off as flat instead of popping off the screen.\n\n                    21 out of 38 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "10",
                "Title": "A total new experience on the second viewing",
                "Content": "After the 1st viewing, I was delightfully surprised at how strong the story is, since what I expected from the trailer was a fun and colorful children's adventure film. But I was deeply touched by the characters and couldn't stop pondering the plot.Then after the 2nd viewing, I discovered the complex psychology of the story. I saw many little clues that I missed the first time and they led to a new interpretation of everything, which gave me many Wow and Aha moments. Also knowing the twist gave me totally new emotional experience watching the characters' reactions in different scenes.My kids as well as I have thoroughly enjoyed the humor, the creativity, and the wonderful visual. For kids it's a perfect imaginative story with a huge twist and a happy ending. For adults, it possesses layers exploring the psychology of the character and it's a bitter-sweet, yet very satisfying emotional journey.It's an entirely original story, which is rare and precious among big-budget films with an all-star cast.The last thing I want to add from my perspective as an artist is that the character design and animation is top-notch. It's not the established Pixar style, but feels very original while fitting the narrative perfectly.\n\n                    56 out of 85 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "6",
                "Title": "Heartfelt and cute film but felt short and thin in places.",
                "Content": "3 out of 5 stars.If is a fair family film that has heart, cute, and has a story that can relate to children and adults. The plot is okay. About a child whos father is in the hospital. She meets a guy who helps imaginary friends characters that noone sees gets back to there original children who are adults now.The humor is okay and cute. The characters are fun. Ryan Reynolds is also good with the role as well as Cailey Fleming. The film does have a theme of never forget your dreams as a child. The music scote by Michael Giacchino is good. John Krasinski did great with his role. His script and direction felt little short handed with the substance of the story. It was lacking a central conflict besides a child growing up and overcoming loneliness. He did okay for a family film. It was not the best. But it was not bad.\n\n                    7 out of 11 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "5",
                "Title": "Disjointed attempt for depth and moving moment",
                "Content": "I'm disappointed in this movie not because it's absolutely terrible but because it could have been much better a properly written story.While there are some funny moments and kind of moving scenes, they're all tied along by a incredibly weak and barebones story, many moments are melodramatic just for the sake of it without earning them, as such the film feels hollow and disjointed.The story as a whole feels like a reject Pixar movie, the impressive cast is mainly cameos, and even Steve Carrell who has more time, barely feels like it has much heart in it. Most of the funny moments are already in the trailers.\n\n                    11 out of 19 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "6",
                "Title": "A movie that's confused about what it should be",
                "Content": "I was really excited for IF from previews. Good cast and a ton of potential to be a legendary kids movie. I think where this movie struggles is that it can't figure out if it's supposed to be a kids movie or an after school special about dealing with trauma and grief.Another area that was annoying was in casting. Ryan Reynolds and Steve Carell are just really unable to be anything else in a movie. The same snark (no swearing) from Reynolds. Dude really just needs to stay in the Deadpool lane. Carell essentially was a big, purple, fluffy Gru.The first 45 minutes were really rough. I'm not sure I heard a kid in my theater laugh until about 35 minutes in. Then it found a kids movie footing and I thought it might end strong. It almost stuck the landing, but then it just wanted to dive back into after school special territory.I didn't hate it. It just isn't really the kind of movie that it's billed as.\n\n                    14 out of 27 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "7",
                "Title": "Fun for the kids",
                "Content": "It's mainly fun for the kids. Adults will get some fun out of it because of the actors and mostly Reynolds' performance. But overall, definitely for the kids. I really enjoyed the imaginary friend sequences, and some of the jokes landed. I feel like some of the acting is a little underwhelming but it definitely isn't too noticeable.A very interesting and well done ending too. It's a perfect and smooth flow throughout the movie. The kids will enjoy it overall, but there are some SLY but near none adult jokes and references. I think the casting is also well done but I wish they introduced some newer actors to show off what they're capable of. But the child actors in this are REALLY GOOD!The movie isn't perfect still. It definitely has some unanswered elements but it is a solid watch for the family. 6.7/10.\n\n                    12 out of 25 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            },
            {
                "Rating": "10",
                "Title": "Loved it",
                "Content": "We talked about it all the way home. We absolutely loved it, loved the girl, loved the plot twist, loved the characters and want to go again to watch for hints of what we missed\nbecause we were so wrapped up in the story. This is a very real story inside of a fantasy and a poignant reminder of the importance of love and connection even when life is hard. Bad things happen and it hurts, but love and imagination and knowing you can find ways to cope is a lesson meta naysayers seem to have missedI cannot understand the low meta rating...is media just that jaded ? It is a beautiful story and so worth seeing.\n\n                    23 out of 32 found this helpful.\n                        \n                            Was this review helpful?  Sign in to vote.\n                        \n\nPermalink"
            }
        ],
        "Directors": [
            "Director",
            "John Krasinski"
        ],
        "Writers": [
            "Writer",
            "John Krasinski"
        ],
        "Stars": [
            "Cailey Fleming",
            "Ryan Reynolds",
            "John Krasinski"
        ],
        "Details": {
            "Release-Date": "May 17, 2024 (United States)",
            "Country-Origin": "United States",
            "Language": "LanguageEnglish"
        },
        "BoxOfficeDetails": {
            "Budget": "$110,000,000 (estimated)",
            "Gross US & Canada": "$106,552,708",
            "Opening weekend US & Canada": {
                "Collection": "$33,715,801",
                "Date": "May 19, 2024"
            },
            "Gross worldwide": "$181,252,708"
        },
        "name": "5. IF"
    }
]